[
  {
    "model": "Renault Megane",
    "url": "https://es.wallapop.com/item/renault-clio-unica-propietaria-1-ano-de-garantia-1066864282",
    "score": 88,
    "price_score": 80,
    "mileage_score": 90,
    "year_score": 100,
    "condition_score": 85,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car received a score of 88 out of 100. The price score is 80 because the asking price of 6990 euros is lower than the reference price of 9100 euros. However, it is still slightly higher than what one might expect for a 2012 Clio with 100,000 km. The mileage score is 90, as the car has only 100,000 km, which is within the target range and is relatively low for a 2012 model. The year score is 100, as the car is within the target range of 2010-2014. The condition score is 85, as the car has had recent maintenance and comes with a one-year warranty, but the description does not provide enough information to determine its overall condition. The seller score is 70, as the car is being sold by a dealer, which may result in a higher price compared to a private sale. The features score is 80, as the car has several desirable features such as Bluetooth integration, cruise control, and electric mirrors.",
    "reference_price": "9.100 euros",
    "reference_kilometers": "100.000 - 150.000 km",
    "reference_year_range": "2010-2014"
  },
  {
    "model": "Seat León",
    "url": "https://es.wallapop.com/item/seat-leon-1-5-tsi-96kw-s-s-style-1070561382",
    "score": 88,
    "price_score": 85,
    "mileage_score": 80,
    "year_score": 100,
    "condition_score": 85,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car received a high score for the year, as it is within the target range (2021). The price is slightly below the reference range (15.490 euros), so it got a slightly lower score. The mileage is a bit higher than the reference range (29,990 km), which affected its score. The car's condition is described as good, but not exceptional, so it received a middle score. The seller is a dealer, which generally means the car has been inspected and serviced, but it's not as convenient as buying from a private seller. The car has some additional features, but not a large number, so it received a middle score.",
    "reference_price": "18.500 - 20.500 euros",
    "reference_kilometers": "25.000 - 55.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Seat León",
    "url": "https://es.wallapop.com/item/seat-leon-1-5-tsi-110kw-s-s-xcellence-1067692571",
    "score": 88,
    "price_score": 85,
    "mileage_score": 80,
    "year_score": 100,
    "condition_score": 85,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car received a high score for year as it is within the target range (2021). The price is slightly below the reference range, so it got an 85 for price. Mileage is a bit lower than the reference range, hence the score of 80. The car's condition is good based on the description, so it received an 85. The seller is a dealer, which lowers the score to 70. The car has some additional features, so it received an 80 for features.",
    "reference_price": "18.500 - 20.500 euros",
    "reference_kilometers": "25.000 - 55.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Seat León",
    "url": "https://es.wallapop.com/item/seat-leon-1-0-tsi-sands-style-81-kw-110-cv-1052062574",
    "score": 88,
    "price_score": 80,
    "mileage_score": 90,
    "year_score": 100,
    "condition_score": 85,
    "seller_score": 80,
    "features_score": 90,
    "explanation": "The car received a score of 88 out of 100. The price is 80 points, slightly below the reference range. The mileage is 90 points, which is quite good. The car is within the target year range, so it received 100 points for year. The condition and maintenance are rated at 85 points based on the description. The seller is a dealer, so it received 80 points for seller type. The car has several additional features, which earned it 90 points for features.",
    "reference_price": "18.500 - 20.500 euros",
    "reference_kilometers": "25.000 - 55.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Seat León",
    "url": "https://es.wallapop.com/item/seat-leon-st-1-5-tsi-sands-style-go-96-kw-130-cv-1047314586",
    "score": 88,
    "price_score": 80,
    "mileage_score": 85,
    "year_score": 100,
    "condition_score": 85,
    "seller_score": 70,
    "features_score": 90,
    "explanation": "The car received a high year score because it is within the target range (2021). The price score is 80 out of 100, as the price is slightly below the reference range (18,090 EUR vs. 18,500 - 20,500 EUR). The mileage score is 85 out of 100, as it is below the average of the reference range (38,504 km vs. 25,000 - 55,000 km). The condition score is 85 out of 100, based on the provided description, which includes a 1-year warranty, no structural damage, and a certified mileage. The seller score is 70 out of 100, as it is a dealer, not a private seller. The features score is 90 out of 100, as the car has several desirable features, such as Car Play, a rearview camera, parking assistance, LED headlights and taillights, automatic headlights, rain sensor, electric parking brake, speed control, a multifunction steering wheel, push-button start, air conditioning, Bluetooth, Isofix, and alloy wheels.",
    "reference_price": "18.500 - 20.500 euros",
    "reference_kilometers": "25.000 - 55.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Ford Puma",
    "url": "https://es.wallapop.com/item/ford-puma-1-0-ecoboost-125cv-st-line-mhev-1066362356",
    "score": 88,
    "price_score": 90,
    "mileage_score": 80,
    "year_score": 100,
    "condition_score": 85,
    "seller_score": 80,
    "features_score": 85,
    "explanation": "The car received a high score for its price, being under the reference range. The mileage is slightly higher than the average reference range, hence the score of 80. The car is within the target year range, so it received a perfect score for that criterion. The overall condition and maintenance are good, but not excellent, hence the score of 85. The seller is a dealer, which is slightly less favorable than a private seller, but still acceptable. The car has some additional features, which contributed to its score.",
    "reference_price": "19.500 - 21.500 euros",
    "reference_kilometers": "20.000 - 50.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Ford Puma",
    "url": "https://es.wallapop.com/item/ford-puma-1-0-ecoboost-125cv-st-line-mhev-1066349183",
    "score": 88,
    "price_score": 80,
    "mileage_score": 90,
    "year_score": 100,
    "condition_score": 85,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car received a score of 88 out of 100. The price is 15,490 euros, which is below the reference range, but it's for a financed purchase. The mileage is 37,956 km, which is within the reference range and quite low for the car's age. The car is from 2022, which is within the target range and very new. The overall condition and maintenance are described as good, but not perfect. The seller is a dealer, which may affect the negotiation and post-sale service. The car has some additional features like 4x4 and manual transmission, but no major extra equipment.",
    "reference_price": "19.500 - 21.500 euros",
    "reference_kilometers": "20.000 - 50.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Ford Puma",
    "url": "https://es.wallapop.com/item/ford-puma-1-0-ecoboost-125cv-st-line-design-mhev-1066347274",
    "score": 88,
    "price_score": 85,
    "mileage_score": 80,
    "year_score": 100,
    "condition_score": 85,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car received a score of 88 out of 100. The price is slightly below the reference range, which is good and resulted in a price score of 85. The mileage is a bit lower than the reference range, hence the mileage score is 80. The car is new, produced in 2022, which is ideal and gave it a year score of 100. The overall condition and maintenance are described as good, so the condition score is 85. The seller is a dealer, which slightly negatively impacts the seller score (70). The car has some additional features (4x4, electric), which contributed to the features score of 80.",
    "reference_price": "19.500 - 21.500 euros",
    "reference_kilometers": "20.000 - 50.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Ford Puma",
    "url": "https://es.wallapop.com/item/ford-puma-1-0-ecoboost-92kw-125cv-st-line-mhev-1066341615",
    "score": 88,
    "price_score": 85,
    "mileage_score": 80,
    "year_score": 100,
    "condition_score": 85,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car received a high score for year as it is within the target range (2020). The price is slightly below the reference range (16.990 euros) but still close, so it received a score of 85. The mileage is a bit higher than the reference range (48643 km) which resulted in a score of 80. The overall condition and maintenance based on the description is good, but not exceptional, so it received a score of 85. The seller is a dealer, which usually means less risk but also less potential for negotiation, so it received a score of 70. The car has some additional features (4x4, electric) which added to its score.",
    "reference_price": "19.500 - 21.500 euros",
    "reference_kilometers": "20.000 - 50.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Ford Puma",
    "url": "https://es.wallapop.com/item/ford-puma-1-0-ecoboost-125cv-st-line-x-mhev-1066174095",
    "score": 88,
    "price_score": 80,
    "mileage_score": 85,
    "year_score": 100,
    "condition_score": 80,
    "seller_score": 70,
    "features_score": 85,
    "explanation": "The car is being offered at a price of 15,990 EUR, which is slightly below the reference range of 19,500 - 21,500 EUR. This gives it a price score of 80. The mileage of the car is 39,015 km, which is within the reference range of 20,000 - 50,000 km, giving it a mileage score of 85. The car is from the year 2022, which is within the target range of 2020-2022, giving it a year score of 100. The description mentions that the car is in good condition and has been well-maintained, but there are no specific details provided, so it gets a condition score of 80. The car is being sold by a dealer, which is a slight negative as private sales are generally considered to be more trustworthy, so it gets a seller score of 70. The car has several additional features, such as 4x4, electric capabilities, and manual transmission, which give it a features score of 85. Overall, the car scores 88 out of 100.",
    "reference_price": "19.500 - 21.500 euros",
    "reference_kilometers": "20.000 - 50.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Ford Puma",
    "url": "https://es.wallapop.com/item/ford-puma-1-0-ecoboost-125cv-st-line-mhev-auto-1066130757",
    "score": 88,
    "price_score": 85,
    "mileage_score": 80,
    "year_score": 100,
    "condition_score": 85,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car received a score of 88 out of 100. The price is slightly below the reference range, which is good and resulted in a price score of 85. The mileage is a bit lower than the reference range, hence the mileage score is 80. The car is from the target year 2021, so it got a perfect year score of 100. The description suggests a well-maintained car, resulting in a condition score of 85. The seller is a dealer, which slightly negatively impacts the score, resulting in a seller score of 70. The car has some additional features (automatic, MHEV) which resulted in a features score of 80.",
    "reference_price": "19.500 - 21.500 euros",
    "reference_kilometers": "20.000 - 50.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Peugeot 308",
    "url": "https://es.wallapop.com/item/peugeot-308-sw-s-s-eat8-130cv-2020-1057746580",
    "score": 88,
    "price_score": 80,
    "mileage_score": 70,
    "year_score": 100,
    "condition_score": 90,
    "seller_score": 70,
    "features_score": 90,
    "explanation": "The car received a score of 88 out of 100. The price is within the reference range, but slightly on the higher end, so it received an 80. The mileage is a bit higher than the average of the reference range, so it received a 70. The car is from 2020, which is ideal, so it received a 100. The condition of the car is very good based on the description, so it received a 90. The car is being sold by a private party, which can be a bit riskier than a dealer, so it received a 70. The car has several additional features and equipment, which increased its score to 90.",
    "reference_price": "18.000 - 20.000 euros",
    "reference_kilometers": "35.000 - 65.000 km",
    "reference_year_range": "2019-2021"
  },
  {
    "model": "Peugeot 308",
    "url": "https://es.wallapop.com/item/peugeot-308-5p-allure-pack-bluehdi-130-s-s-eat8-1022923766",
    "score": 88,
    "price_score": 80,
    "mileage_score": 85,
    "year_score": 100,
    "condition_score": 85,
    "seller_score": 80,
    "features_score": 85,
    "explanation": "The car received a high score for year as it is within the target range (2021). The price is slightly above the reference range (18.850€), so it got 80 out of 100. Mileage is good, lower than the reference range (38,500 km), so it got 85 out of 100. The overall condition and maintenance are described as having more than 100 points of control revisados and with a 12-month warranty, so it got 85 out of 100. The seller is a dealer (Grup Auto3000), which is slightly less favorable than a private seller, so it got 80 out of 100. Additional features and equipment are not explicitly mentioned, but the car is described as a Peugeot 308 5P Allure Pack BlueHDi 130 S&S EAT8, which indicates a well-equipped model, so it got 85 out of 100.",
    "reference_price": "18.000 - 20.000 euros",
    "reference_kilometers": "35.000 - 65.000 km",
    "reference_year_range": "2019-2021"
  },
  {
    "model": "Citroën C4 Grand Spacetourer",
    "url": "https://es.wallapop.com/item/citroen-grand-c4-spacetourer-puretech-96kw-130cv-s-s-6v-feel-1070035192",
    "score": 88,
    "price_score": 80,
    "mileage_score": 70,
    "year_score": 100,
    "condition_score": 85,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car received a score of 88 out of 100. The price is 13,990 EUR, which is below the reference range, so it got an 80. The mileage is 59,000 km, slightly above the reference range, so it got a 70. The car is from 2020, which is within the target range, so it got a 100. The overall condition and maintenance based on the description is good, so it got an 85. The seller is a dealer, which is less favorable than a private seller, so it got a 70. The car has additional features and equipment, which contributed to an 80.",
    "reference_price": "19.000 - 21.000 euros",
    "reference_kilometers": "40.000 - 70.000 km",
    "reference_year_range": "2018-2020"
  },
  {
    "model": "Renault Clio E-Tech Híbrido",
    "url": "https://es.wallapop.com/item/renault-clio-zen-e-tech-hibrido-103-kw-140-cv-1069422640",
    "score": 88,
    "price_score": 70,
    "mileage_score": 85,
    "year_score": 100,
    "condition_score": 85,
    "seller_score": 70,
    "features_score": 90,
    "explanation": "The car received a high year score because it is within the target range (2021). The mileage score is relatively high (85) since it has 20099 km, which is below the reference range (15000 - 45000 km). The price score is 70 because, although it's within the reference range (19.081 EUR), the price is closer to the lower limit. The overall condition and maintenance score is 85 based on the provided description, mentioning a single owner, a 1-year warranty, and a certificate of kilometers and absence of structural damage. The seller score is 70, as it appears to be a dealer ('OCASIONPLUS'). The features score is 90, as the car has several desirable features like Car Play, a rear camera, parking assistance, LED headlights, adaptive cruise control, and more.",
    "reference_price": "19.500 - 21.500 euros",
    "reference_kilometers": "15.000 - 45.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Renault Clio E-Tech Híbrido",
    "url": "https://es.wallapop.com/item/renault-clio-zen-e-tech-hibrido-103-kw-140-cv-1069079730",
    "score": 88,
    "price_score": 80,
    "mileage_score": 90,
    "year_score": 100,
    "condition_score": 85,
    "seller_score": 80,
    "features_score": 90,
    "explanation": "The car received a high year score because it is within the target range (2021). The mileage score is also high (90) since it has 20099 km, which is below the reference range (15000 - 45000 km). The price score is 80: although the financed price is within the range (19.081 euros), the cash price is slightly above the reference range (20990 euros). The condition score is 85, considering the overall condition and maintenance based on the description. The car has a good maintenance history, one owner, and comes with a 1-year guarantee. However, the description does not provide specific details about the condition. The seller score is 80 because it is a dealer, which might imply slightly higher prices compared to private sellers. The features score is 90, as the car has several desirable features like tapicería cuero-tela, Car Play, cámara de marcha atrás, ayuda aparcamiento, encendido automático de faros, sensor de lluvia, faros led, climatizador, freno de estacionamiento eléctrico, arranque por botón, bluetooth, and isofix.",
    "reference_price": "19.500 - 21.500 euros",
    "reference_kilometers": "15.000 - 45.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Seat Ibiza",
    "url": "https://es.wallapop.com/item/seat-ibiza-1-4-16v-reference-63-kw-85-cv-1065636943",
    "score": 85,
    "price_score": 80,
    "mileage_score": 90,
    "year_score": 80,
    "condition_score": 85,
    "seller_score": 85,
    "features_score": 90,
    "explanation": "The car is a 2012 SEAT Ibiza SC with 99,000 km. The price of 7,590 euros is slightly below the reference price of 8,700 euros, hence the price score is 80. The mileage is within the target range and even on the lower end, so the mileage score is 90. The car is a bit older than the target range, hence the year score is 80. The description suggests that the car is in good condition and has been recently revisited, so the condition score is 85. The seller is a dealer, which is positive, hence the seller score is 85. The car comes with several additional features, which is a plus, so the features score is 90. Overall, the car scores 85 out of 100.",
    "reference_price": "8.700 euros",
    "reference_kilometers": "80.000 - 120.000 km",
    "reference_year_range": "2012-2016"
  },
  {
    "model": "Seat Ibiza",
    "url": "https://es.wallapop.com/item/seat-ibiza-reference-tech-2013-1058281318",
    "score": 85,
    "price_score": 70,
    "mileage_score": 70,
    "year_score": 80,
    "condition_score": 90,
    "seller_score": 85,
    "features_score": 80,
    "explanation": "The car received a score of 85 out of 100. The price score is 70, as the asking price of 6,500 EUR is lower than the reference price of 8,700 EUR. However, it is still significantly above the typical price range for a vehicle with this mileage and age. The mileage score is 70 because the car has 103,000 km, which is slightly higher than the desired range of 80,000-120,000 km. The year score is 80, as the car is from 2013, which is within the target range of 2012-2016. The condition score is 90, as the car has been well-maintained, stored in a garage, and has no history of accidents. The seller score is 85, as the seller is a private party, which is generally more favorable than dealing with a dealer. The features score is 80, as the car has a reasonable set of additional features, including a multifunction steering wheel, air conditioning, a media player, and more.",
    "reference_price": "8.700 euros",
    "reference_kilometers": "80.000 - 120.000 km",
    "reference_year_range": "2012-2016"
  },
  {
    "model": "Ford Focus",
    "url": "https://es.wallapop.com/item/renault-clio-unica-propietaria-1-ano-de-garantia-1066864282",
    "score": 85,
    "price_score": 80,
    "mileage_score": 90,
    "year_score": 100,
    "condition_score": 85,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car received a score of 85 out of 100. The price score is 80, as the asking price of 6990 euros is lower than the reference price of 9200 euros. However, it is still slightly higher than the average price for a 2012 Clio with similar mileage. The mileage score is 90, as the car has only 100,000 km, which is within the target range and lower than the average for cars of this age. The year score is 100, as the car is from 2012, which is within the target range of 2011-2015. The condition score is 85, as the car has been well-maintained and recently serviced, but it is not in perfect condition due to its age and mileage. The seller score is 70, as the car is being sold by a dealership, which may be less trustworthy and more expensive than a private seller. The features score is 80, as the car has several desirable features such as bluetooth integration, cruise control, and electric mirrors.",
    "reference_price": "9.200 euros",
    "reference_kilometers": "90.000 - 140.000 km",
    "reference_year_range": "2011-2015"
  },
  {
    "model": "Renault Clio",
    "url": "https://es.wallapop.com/item/renault-clio-80-000km-1016879750",
    "score": 85,
    "price_score": 70,
    "mileage_score": 80,
    "year_score": 85,
    "condition_score": 90,
    "seller_score": 80,
    "features_score": 85,
    "explanation": "The car received a score of 85 out of 100. The price score is 70, as the asking price of 7900 euros is lower than the reference price of 8900 euros. However, it is still significantly above the financied price of 7400 euros. The mileage score is 80, as the car has 81,358 km, which is within the reference range of 70,000 - 110,000 km. The year score is 85, as the car is from 2014, which is within the target range of 2013-2017. The condition score is 90, as the car is described as 'impecable' with maintenance up to date, ITV in vigor, and a 12-month warranty. The seller score is 80, as the car is being sold by a dealer. The features score is 85, as the car has air conditioning, multi-function steering wheel, original radio, on-board computer, and two sets of keys.",
    "reference_price": "8.900 euros",
    "reference_kilometers": "70.000 - 110.000 km",
    "reference_year_range": "2013-2017"
  },
  {
    "model": "Opel Corsa",
    "url": "https://es.wallapop.com/item/opel-corsa-1-4-selective-1068002982",
    "score": 85,
    "price_score": 90,
    "mileage_score": 70,
    "year_score": 85,
    "condition_score": 80,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car received a score of 85 out of 100. The price is quite good, with a score of 90, as it's below the reference price. However, the mileage is a bit higher than the preferred range, resulting in a score of 70. The car's year is within the target range, so it gets a score of 85. The overall condition and maintenance are described as satisfactory, earning a score of 80. The car is being sold by a dealer, which is not ideal, so it gets a score of 70. The car has some additional features, which contribute to a score of 80. The final score is the average of the individual scores.",
    "reference_price": "8.500 euros",
    "reference_kilometers": "80.000 - 120.000 km",
    "reference_year_range": "2011-2015"
  },
  {
    "model": "Opel Corsa",
    "url": "https://es.wallapop.com/item/renault-clio-unica-propietaria-1-ano-de-garantia-1066864282",
    "score": 85,
    "price_score": 85,
    "mileage_score": 80,
    "year_score": 100,
    "condition_score": 85,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car received a score of 85/100. The price is 15% lower than the reference, so it received a price score of 85. The mileage is slightly higher than the reference, so it received a mileage score of 80. The car is within the target year range, so it received a year score of 100. The overall condition and maintenance are good based on the description, so it received a condition score of 85. The car is being sold by a dealer, which is less favorable than a private sale, so it received a seller score of 70. The car has several additional features, which contributed to a features score of 80.",
    "reference_price": "8.500 euros",
    "reference_kilometers": "80.000 - 120.000 km",
    "reference_year_range": "2011-2015"
  },
  {
    "model": "Opel Corsa",
    "url": "https://es.wallapop.com/item/opel-corsa-2013-1058011179",
    "score": 85,
    "price_score": 85,
    "mileage_score": 70,
    "year_score": 100,
    "condition_score": 90,
    "seller_score": 80,
    "features_score": 70,
    "explanation": "The car received a score of 85 out of 100. The price score is 85, as it is 57% cheaper than a new car. The mileage score is 70, since it has 116,000 km, which is slightly higher than the reference range. The year score is 100, as it is within the target range (2011-2015). The condition score is 90, as the car was well-maintained, recently serviced, and has a perfect exterior. The seller score is 80, as it is a private seller. The features score is 70, as it has standard features for its model.",
    "reference_price": "8.500 euros",
    "reference_kilometers": "80.000 - 120.000 km",
    "reference_year_range": "2011-2015"
  },
  {
    "model": "Peugeot 208",
    "url": "https://es.wallapop.com/item/peugeot-208-pegatina-c-1066588571",
    "score": 85,
    "price_score": 85,
    "mileage_score": 90,
    "year_score": 100,
    "condition_score": 80,
    "seller_score": 70,
    "features_score": 70,
    "explanation": "The car received a score of 85/100. The price is slightly below the reference price, so it got an 85/100 for price. The mileage is well below the reference range, so it received a 90/100 for mileage. The car is within the target year range, so it got a perfect 100/100 for year. The condition is described as good, but there are some minor scratches, so it received an 80/100 for condition. The seller is a private party, which is slightly less desirable than a dealer, so it received a 70/100 for seller. The car has manual transmission and some additional features, so it received a 70/100 for features.",
    "reference_price": "8.800 euros",
    "reference_kilometers": "75.000 - 115.000 km",
    "reference_year_range": "2012-2016"
  },
  {
    "model": "Citroën C3",
    "url": "https://es.wallapop.com/item/renault-clio-unica-propietaria-1-ano-de-garantia-1066864282",
    "score": 85,
    "price_score": 80,
    "mileage_score": 85,
    "year_score": 85,
    "condition_score": 90,
    "seller_score": 80,
    "features_score": 85,
    "explanation": "The car received a score of 85 out of 100. The price score is 80, as it is 57% cheaper than a new one, but still higher than the reference price. The mileage score is 85, as it has 100,000 km which is within the reference range. The year score is 85, as it is within the target range (2011-2015). The condition score is 90, as the car has been well-maintained with recent revisions, oil change, and a changed timing belt. The seller score is 80, as it is a dealership, which may have higher prices than private sellers. The features score is 85, as it has several additional features like Bluetooth, cruise control, and electric mirrors.",
    "reference_price": "8.300 euros",
    "reference_kilometers": "80.000 - 120.000 km",
    "reference_year_range": "2011-2015"
  },
  {
    "model": "Citroën C3",
    "url": "https://es.wallapop.com/item/citroen-c3-picasso-vti-95cv-seduction-1066067605",
    "score": 85,
    "price_score": 80,
    "mileage_score": 70,
    "year_score": 100,
    "condition_score": 85,
    "seller_score": 80,
    "features_score": 80,
    "explanation": "The car received a score of 85 out of 100. The price is quite good, given the original price is 8.300 euros and the offer price is 6.990 euros, which is why it got an 80. However, the mileage is a bit high at 92603 km, which is why it only received a 70. The car is within the target range, which is why it received a full score of 100. The condition and maintenance seem to be good based on the description, so it received an 85. The car is being sold by a dealer, which is why it received an 80. Lastly, the car has some additional features, but not many, which is why it received an 80.",
    "reference_price": "8.300 euros",
    "reference_kilometers": "80.000 - 120.000 km",
    "reference_year_range": "2011-2015"
  },
  {
    "model": "Citroën C3",
    "url": "https://es.wallapop.com/item/citroen-c3-gasolina-pegatina-c-verde-1062377115",
    "score": 85,
    "price_score": 80,
    "mileage_score": 70,
    "year_score": 100,
    "condition_score": 85,
    "seller_score": 70,
    "features_score": 90,
    "explanation": "The car is listed at a price of 6999 euros, which is quite a bit lower than the reference price of 8300 euros, so it gets a good score for price. However, the mileage is a bit higher than the reference range at 110,000 km, so it gets a slightly lower score for mileage. The car is from the target year range of 2011-2015, so it gets a perfect score for year. Based on the description, the car seems to be in good condition and has been well-maintained, so it gets a high score for condition. The car is being sold by a dealer, which is a slight negative compared to a private seller, so it gets a lower score for seller type. The car has several additional features and equipment, which adds to its value and earns it a high score for features.",
    "reference_price": "8.300 euros",
    "reference_kilometers": "80.000 - 120.000 km",
    "reference_year_range": "2011-2015"
  },
  {
    "model": "Fiat 500",
    "url": "https://es.wallapop.com/item/fiat-500-2011-1053261610",
    "score": 85,
    "price_score": 80,
    "mileage_score": 85,
    "year_score": 85,
    "condition_score": 90,
    "seller_score": 80,
    "features_score": 80,
    "explanation": "The car received a score of 85 out of 100. The price score is 80, as the car is listed for 6500 euros which is significantly lower than the reference price of 7900 euros. The mileage score is 85, as the car has 98300 km which is within the target range of 60,000 - 100,000 km. The year score is 85, as the car is from 2011 which is within the target range of 2010-2014. The condition score is 90, as the seller mentions that the car has been well-maintained, with ruedas, sistema aire acondicionado, frenos, and batería changed this year and the correa de distribución changed a year ago. The seller score is 80, as the seller is a private party, which can sometimes be less reliable than a dealer. The features score is 80, as the car has a techo panorámico and distintivo medio ambiental C, which allows it to access low-emission zones without any inconvenience.",
    "reference_price": "7.900 euros",
    "reference_kilometers": "60.000 - 100.000 km",
    "reference_year_range": "2010-2014"
  },
  {
    "model": "Fiat 500",
    "url": "https://es.wallapop.com/item/fiat-500-2012-996437364",
    "score": 85,
    "price_score": 90,
    "mileage_score": 80,
    "year_score": 85,
    "condition_score": 90,
    "seller_score": 80,
    "features_score": 80,
    "explanation": "The car received a high price score of 90 because it is listed for 7,900 euros, which is close to the reference price of 7,900 euros. The mileage score is 80, which is slightly lower than the reference range of 60,000 - 100,000 km, as the car has 80,000 km. The year score is 85, as the car is from 2012, which is within the target range of 2010-2014. The condition score is 90, as the car is described as being in excellent condition, with little use and always parked in a private garage. The seller score is 80, as the car is being sold by a private party. The features score is 80, as the car has standard features and equipment.",
    "reference_price": "7.900 euros",
    "reference_kilometers": "60.000 - 100.000 km",
    "reference_year_range": "2010-2014"
  },
  {
    "model": "Seat León",
    "url": "https://es.wallapop.com/item/seat-leon-1-5-tsi-sands-fr-fast-edition-110-kw-150-cv-1066771795",
    "score": 85,
    "price_score": 70,
    "mileage_score": 80,
    "year_score": 100,
    "condition_score": 85,
    "seller_score": 80,
    "features_score": 90,
    "explanation": "The car received a score of 85 out of 100. The price is 955 EUR below the reference range, which resulted in a price score of 70. The mileage is within the reference range, so it received a score of 80. The car is from the target year 2020, giving it a perfect score of 100. The overall condition and maintenance are good based on the description, earning a score of 85. The seller is a dealer, which is slightly less favorable than a private seller, so it received a score of 80. The car has several additional features and equipment, resulting in a score of 90.",
    "reference_price": "18.500 - 20.500 euros",
    "reference_kilometers": "25.000 - 55.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Seat León",
    "url": "https://es.wallapop.com/item/seat-leon-1-5-tsi-110kw-s-s-fr-1066172500",
    "score": 85,
    "price_score": 70,
    "mileage_score": 80,
    "year_score": 100,
    "condition_score": 85,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car being appraised is a Seat Leon 1.5 TSI 110kW S&S FR, located in Barcelona. The list price of the car is 17,650 EUR, which is slightly below the reference range of 18,500 - 20,500 EUR, hence the price score is 70. The car has a mileage of 50,000 km, which is within the reference range of 25,000 - 55,000 km, hence the mileage score is 80. The car is from the year 2022, which is well within the target range of 2020-2022, hence the year score is 100. Based on the description, the overall condition and maintenance of the car appears to be good, hence the condition score is 85. The car is being sold by a dealer, hence the seller score is 70. The car has features such as manual transmission and 150 horsepower, hence the features score is 80. The final score is calculated based on the above individual scores.",
    "reference_price": "18.500 - 20.500 euros",
    "reference_kilometers": "25.000 - 55.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Seat León",
    "url": "https://es.wallapop.com/item/seat-leon-1-5-tsi-110kw-s-s-fr-1066162630",
    "score": 85,
    "price_score": 80,
    "mileage_score": 85,
    "year_score": 100,
    "condition_score": 80,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car being appraised is a Seat Leon 1.5 TSI 110kW S&S FR, located in Barcelona. The price of 19,450 EUR is slightly below the reference range (18,500 - 20,500 EUR), earning a score of 80. The mileage of 29,000 km is well within the reference range (25,000 - 55,000 km), earning a score of 85. The car is from the year 2022, which is within the target range (2020-2022), earning a perfect score of 100. The overall condition and maintenance based on the description is good, but not exceptional, earning a score of 80. The seller is a dealer, which may affect the negotiation flexibility and pricing, earning a score of 70. The car comes with additional features and equipment, but no specific details are given, so a score of 80 is assigned.",
    "reference_price": "18.500 - 20.500 euros",
    "reference_kilometers": "25.000 - 55.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Seat León",
    "url": "https://es.wallapop.com/item/seat-leon-1-0-tsi-sands-style-81-kw-110-cv-1052064230",
    "score": 85,
    "price_score": 80,
    "mileage_score": 90,
    "year_score": 100,
    "condition_score": 85,
    "seller_score": 80,
    "features_score": 85,
    "explanation": "The car received a score of 85 out of 100. The price is slightly below the reference range, which earned it an 80. The mileage is very good, with only 30499 km, so it received a 90. The car is from 2020, which is ideal, so it got a perfect 100. The condition and maintenance description seem positive, but not exceptional, so it received an 85. The seller is a dealer, not a private party, so it got an 80. The car has several additional features, which earned it an 85.",
    "reference_price": "18.500 - 20.500 euros",
    "reference_kilometers": "25.000 - 55.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Ford Puma",
    "url": "https://es.wallapop.com/item/ford-puma-1-0-ecoboost-125cv-titanium-mhev-1066367110",
    "score": 85,
    "price_score": 80,
    "mileage_score": 85,
    "year_score": 100,
    "condition_score": 80,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car being appraised is a 2021 Ford Puma with 40338 km. The price of 14,990€ is slightly below the reference range, hence the price score is 80. The mileage is within the reference range, so the mileage score is 85. The car is of the correct year, so the year score is 100. The condition of the car is described as good, but not exceptional, hence the condition score is 80. The seller is a dealer, which can sometimes indicate higher prices and less personal attention, so the seller score is 70. The car has additional features such as 4x4 and electric capabilities, which adds to its value, so the features score is 80. Overall, the car receives a score of 85.",
    "reference_price": "19.500 - 21.500 euros",
    "reference_kilometers": "20.000 - 50.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Ford Puma",
    "url": "https://es.wallapop.com/item/ford-puma-1-0-ecoboost-92kw-125cv-st-line-mhev-1066346656",
    "score": 85,
    "price_score": 80,
    "mileage_score": 90,
    "year_score": 100,
    "condition_score": 85,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car received a score of 85 out of 100. The price is slightly lower than the reference range, which is good, but not significantly lower, hence the price score of 80. The mileage is very good, below the reference range, so the mileage score is 90. The car is of the correct year, so it received a perfect score of 100. The condition and maintenance description is positive, but not exceptionally detailed, resulting in a score of 85. The seller is a dealer, which is slightly less favorable than a private seller, hence the score of 70. The car has some additional features, which is positive, so it received a score of 80.",
    "reference_price": "19.500 - 21.500 euros",
    "reference_kilometers": "20.000 - 50.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Ford Puma",
    "url": "https://es.wallapop.com/item/ford-puma-1-0-ecoboost-125cv-st-line-design-mhev-1066344233",
    "score": 85,
    "price_score": 85,
    "mileage_score": 70,
    "year_score": 100,
    "condition_score": 80,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car received a score of 85 out of 100. The price is slightly below the reference range, earning a score of 85. The mileage is a bit higher than the reference range, resulting in a score of 70. The car is within the target year range, so it received a perfect score of 100 for the year. The overall condition and maintenance based on the description seem good, earning a score of 80. The seller is a dealer, which is less favorable than a private seller, hence a score of 70. The car has some additional features, which contributed to a score of 80 for features.",
    "reference_price": "19.500 - 21.500 euros",
    "reference_kilometers": "20.000 - 50.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Ford Puma",
    "url": "https://es.wallapop.com/item/ford-puma-1-0-ecoboost-114kw-st-line-x-mhev-1066343797",
    "score": 85,
    "price_score": 80,
    "mileage_score": 70,
    "year_score": 100,
    "condition_score": 85,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car received a score of 85 out of 100. The price is slightly below the reference range, which is good, earning a score of 80. However, the mileage is a bit higher than the reference range, bringing down the score to 70. The car is within the target year range, so it received a perfect score of 100. The overall condition and maintenance based on the description seem good, earning a score of 85. The seller is a dealer, which is not ideal but not terrible either, so it received a score of 70. The car has some additional features and equipment, earning a score of 80.",
    "reference_price": "19.500 - 21.500 euros",
    "reference_kilometers": "20.000 - 50.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Ford Puma",
    "url": "https://es.wallapop.com/item/ford-puma-1-0-ecoboost-125cv-st-line-design-mhev-1066199465",
    "score": 85,
    "price_score": 80,
    "mileage_score": 85,
    "year_score": 100,
    "condition_score": 80,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car received a score of 85 out of 100. The price is slightly below the reference range, hence the price score is 80. The mileage is relatively low at 20480 km, so the mileage score is 85. The car is from the target year 2022, so the year score is 100. The condition is described as good but not exceptional, leading to a condition score of 80. The seller is a dealer, which is a slight disadvantage, hence the seller score is 70. The car has some additional features like 4x4 and manual transmission, but lacks others like automatic transmission or advanced safety features, resulting in a features score of 80.",
    "reference_price": "19.500 - 21.500 euros",
    "reference_kilometers": "20.000 - 50.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Ford Puma",
    "url": "https://es.wallapop.com/item/ford-puma-1-0-ecoboost-92kw-125cv-st-line-mhev-1064563878",
    "score": 85,
    "price_score": 80,
    "mileage_score": 90,
    "year_score": 100,
    "condition_score": 75,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car received a score of 85 out of 100. The price is 14,990 EUR, which is below the reference range, so it got a score of 80. The mileage is 22,596 km, which is within the reference range, so it got a score of 90. The car is from 2020, which is within the target range, so it got a score of 100. The overall condition and maintenance are described as 'very flexible' but not thoroughly inspected, so it got a score of 75. The seller is a dealer, which might affect the negotiation flexibility, so it got a score of 70. The car has some additional features like 4x4 and manual transmission, so it got a score of 80.",
    "reference_price": "19.500 - 21.500 euros",
    "reference_kilometers": "20.000 - 50.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Ford Puma",
    "url": "https://es.wallapop.com/item/ford-puma-2020-1052189795",
    "score": 85,
    "price_score": 70,
    "mileage_score": 85,
    "year_score": 100,
    "condition_score": 85,
    "seller_score": 80,
    "features_score": 90,
    "explanation": "The car received a score of 85 out of 100. The price score is 70 because the car is listed for 18,800 euros, which is slightly below the reference range of 19,500 - 21,500 euros. The mileage score is 85 as the car has 22,000 km, which is within the reference range of 20,000 - 50,000 km. The year score is 100 as the car is from 2020, which is within the target range of 2020-2022. The condition score is 85 based on the description of the car being in excellent condition with several extras such as carplay, wireless charging, and massaging seats. The seller score is 80 as the car is being sold by a private party, which can be slightly less reliable than a dealer. The features score is 90 as the car has several desirable features, including carplay, wireless charging, and massaging seats.",
    "reference_price": "19.500 - 21.500 euros",
    "reference_kilometers": "20.000 - 50.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Peugeot 308",
    "url": "https://es.wallapop.com/item/peugeot-308-sw-allure-pack-1068865592",
    "score": 85,
    "price_score": 80,
    "mileage_score": 70,
    "year_score": 100,
    "condition_score": 85,
    "seller_score": 70,
    "features_score": 90,
    "explanation": "The car received a score of 85 out of 100. The price is slightly below the reference range, so it got an 80. The mileage is a bit higher than the reference range, hence the 70. The car is from 2021, which is within the target range, so it got a perfect 100. The overall condition and maintenance based on the description seem good, so it received an 85. The car is being sold by a dealer, so it got a 70. The car has several additional features and equipment, which earned it a 90.",
    "reference_price": "18.000 - 20.000 euros",
    "reference_kilometers": "35.000 - 65.000 km",
    "reference_year_range": "2019-2021"
  },
  {
    "model": "Peugeot 308",
    "url": "https://es.wallapop.com/item/peugeot-308-sw-active-bluehdi-130-s-s-eat8-1066106501",
    "score": 85,
    "price_score": 70,
    "mileage_score": 80,
    "year_score": 100,
    "condition_score": 85,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car being appraised is a 2020 Peugeot 308 SW Active BlueHDi 130 S&S EAT8 with 40,000 km, listed at 15,490€. The price is slightly below the reference range (18,000 - 20,000 euros), hence the price score is 70. The mileage is within the reference range (35,000 - 65,000 km), so the mileage score is 80. The car is from the target year (2019-2021), so the year score is 100. The description suggests the car is in good condition and has been maintained properly, so the condition score is 85. The seller is a dealer, which could affect the negotiation and post-sale process, so the seller score is 70. The car has automatic transmission and is a station wagon, which are desirable features, so the features score is 80. Overall, the car receives a score of 85.",
    "reference_price": "18.000 - 20.000 euros",
    "reference_kilometers": "35.000 - 65.000 km",
    "reference_year_range": "2019-2021"
  },
  {
    "model": "Citroën C4 Grand Spacetourer",
    "url": "https://es.wallapop.com/item/citroen-grand-c4-spacetourer-puretech-96kw-130cv-s-s-6v-feel-1069983442",
    "score": 85,
    "price_score": 80,
    "mileage_score": 90,
    "year_score": 100,
    "condition_score": 85,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car being appraised is a 2020 Citroën Grand C4 SpaceTourer with 59,000 km. The price of 13,990€ is below the reference range (19,000 - 21,000 euros), so it gets an 80 out of 100. The mileage is well below the reference range (40,000 - 70,000 km), so it gets a 90 out of 100. The car is within the target range of 2018-2020, so it gets a 100 out of 100. The overall condition and maintenance are described as good, but not excellent, so it gets an 85 out of 100. The seller is a dealer, which is less favorable than a private seller, so it gets a 70 out of 100. The car has a good set of additional features and equipment, so it gets an 80 out of 100.",
    "reference_price": "19.000 - 21.000 euros",
    "reference_kilometers": "40.000 - 70.000 km",
    "reference_year_range": "2018-2020"
  },
  {
    "model": "Citroën C4 Grand Spacetourer",
    "url": "https://es.wallapop.com/item/citroen-grand-c4-spacetourer-2019-1032493275",
    "score": 84,
    "price_score": 90,
    "mileage_score": 70,
    "year_score": 100,
    "condition_score": 85,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car received a high score for its price, which is significantly lower than the reference price range. The mileage is slightly lower than the preferred range, hence the lower score. The car's year is within the target range, earning it a perfect score. The overall condition and maintenance are good based on the description, earning it a high score. The seller is a private party, which slightly lowers the score. The car has several additional features, which boosts its score.",
    "reference_price": "19.000 - 21.000 euros",
    "reference_kilometers": "40.000 - 70.000 km",
    "reference_year_range": "2018-2020"
  },
  {
    "model": "Renault Clio",
    "url": "https://es.wallapop.com/item/fiat-500c-automatico-1053513754",
    "score": 83,
    "price_score": 85,
    "mileage_score": 80,
    "year_score": 80,
    "condition_score": 85,
    "seller_score": 70,
    "features_score": 90,
    "explanation": "The car received a price score of 85, as the asking price of 8600 euros is slightly below the reference price of 8900 euros. The mileage score is 80, as the car has 85,000 km which is near the upper limit of the reference range. The year score is 80, as the car is from 2013 which is at the beginning of the target range. The condition score is 85, as the car is described as reliable, well-maintained, and with low mileage. The seller score is 70, as it is being sold by a dealer and not a private party. The features score is 90, as the car has several additional features such as automatic transmission, air conditioning, and sensor parking.",
    "reference_price": "8.900 euros",
    "reference_kilometers": "70.000 - 110.000 km",
    "reference_year_range": "2013-2017"
  },
  {
    "model": "Peugeot 208",
    "url": "https://es.wallapop.com/item/peugeot-208-active-1068864422",
    "score": 83,
    "price_score": 70,
    "mileage_score": 85,
    "year_score": 80,
    "condition_score": 90,
    "seller_score": 80,
    "features_score": 85,
    "explanation": "The car received a score of 83 out of 100. The price score is 70 because the asking price of 8440 euros is slightly higher than the reference price of 8800 euros. The mileage score is 85 as the car has 75,725 km, which is within the reference range of 75,000 - 115,000 km. The year score is 80 since the car is from 2015, which is in the target range of 2012-2016. The condition score is 90 because the description indicates that the car is in excellent condition with up to 4 years of warranty. The seller score is 80 because it's a dealer, not a private seller. The features score is 85 because the car has some extra features such as fog lights, painted mirrors, and a navigation system.",
    "reference_price": "8.800 euros",
    "reference_kilometers": "75.000 - 115.000 km",
    "reference_year_range": "2012-2016"
  },
  {
    "model": "Seat Ibiza",
    "url": "https://es.wallapop.com/item/seat-ibiza-1-2-12v-70cv-reference-1036692546",
    "score": 82,
    "price_score": 70,
    "mileage_score": 85,
    "year_score": 80,
    "condition_score": 85,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car is a 2015 Seat Ibiza with 80,000 km, which are both within the reference range. The price of 6,990 euros is slightly lower than the reference price of 8,700 euros, hence the price score is 70. The mileage score is high because it is at the lower end of the reference range. The car's year is in the target range, so it gets a score of 80. The overall condition and maintenance based on the description is good, hence the condition score is 85. The car is being sold by a dealer, which is less favorable than a private sale, hence the seller score is 70. The car has several additional features and equipment, which is why the features score is 80.",
    "reference_price": "8.700 euros",
    "reference_kilometers": "80.000 - 120.000 km",
    "reference_year_range": "2012-2016"
  },
  {
    "model": "Ford Focus",
    "url": "https://es.wallapop.com/item/ford-focus-2014-1061876238",
    "score": 82,
    "price_score": 85,
    "mileage_score": 70,
    "year_score": 100,
    "condition_score": 85,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car received a high year score because it is within the target range (2014). The price score is 85 because it is 57% cheaper than a new car. However, the price is still lower than the reference of 9.200 euros, which negatively affects the score. The mileage score is 70 because it is slightly higher than the reference range (132.000 km vs 90.000 - 140.000 km). The condition score is 85 because the car is described as being in very good condition with several features and equipment. The seller score is 70 because it is a private seller, which can be riskier than a dealer. The features score is 80 because the car has several additional features such as parking sensors, xenon and LED lights, and a bi-zone climate controller.",
    "reference_price": "9.200 euros",
    "reference_kilometers": "90.000 - 140.000 km",
    "reference_year_range": "2011-2015"
  },
  {
    "model": "Opel Corsa",
    "url": "https://es.wallapop.com/item/opel-corsa-1-3-eco-flex-75cv-1009945642",
    "score": 82,
    "price_score": 85,
    "mileage_score": 70,
    "year_score": 85,
    "condition_score": 85,
    "seller_score": 80,
    "features_score": 80,
    "explanation": "The car received a score of 82 out of 100. The price score is 85, as the car is listed for 6,300€, which is significantly lower than the reference price of 8,500€. The mileage score is 70, as the car has 90,000 km, which is towards the higher end of the reference range of 80,000 - 120,000 km. The year score is 85, as the car is from 2012, which is within the target range of 2011-2015. The condition score is 85, based on the description of the car being 'impecable' and having new tires, as well as a 12-month warranty and maintenance. The seller score is 80, as the seller is a dealer, which can provide some assurance but may also result in a higher price. The features score is 80, as the car has air conditioning and a distintivo medioambiental B EURO 4, which are positive features.",
    "reference_price": "8.500 euros",
    "reference_kilometers": "80.000 - 120.000 km",
    "reference_year_range": "2011-2015"
  },
  {
    "model": "Renault Megane",
    "url": "https://es.wallapop.com/item/renault-megane-coupe-1-5-dci-dynamique-78-kw-105-cv-1035221221",
    "score": 82,
    "price_score": 70,
    "mileage_score": 85,
    "year_score": 80,
    "condition_score": 85,
    "seller_score": 80,
    "features_score": 80,
    "explanation": "The car received a score of 82 out of 100. The price score is 70, as the asking price of 7590 euros is lower than the reference price of 9100 euros. However, it might still be slightly overpriced considering the mileage and year of the vehicle. The mileage score is 85, as the car has 129,000 km, which is within the target range and lower than the upper limit of 150,000 km. The year score is 80, as the car is from 2010, which is within the target range of 2010-2014. The condition score is 85, based on the description mentioning that the vehicle has been inspected and revisited in more than 90 points, and it comes with a 12-month warranty. The seller score is 80, as the seller is a dealer, which is slightly less favorable than a private seller. The features score is 80, as the car has some additional features such as painted in metallic color, air conditioning, electric windows, and cruise control.",
    "reference_price": "9.100 euros",
    "reference_kilometers": "100.000 - 150.000 km",
    "reference_year_range": "2010-2014"
  },
  {
    "model": "Peugeot 208",
    "url": "https://es.wallapop.com/item/peugeot-208-2015-1065918186",
    "score": 82,
    "price_score": 85,
    "mileage_score": 70,
    "year_score": 100,
    "condition_score": 90,
    "seller_score": 80,
    "features_score": 70,
    "explanation": "The car received a score of 82 out of 100. Here's the breakdown:\n- Price score: 85. The asking price of 7490 euros is slightly below the reference price of 8800 euros, which is a positive factor.\n- Mileage score: 70. With 96,000 km, the car has higher mileage compared to the reference range of 75,000 - 115,000 km, which negatively impacts the score.\n- Year score: 100. The car is a 2015 model, which is within the target range of 2012-2016.\n- Condition score: 90. The seller mentions that the car is in perfect condition, with a recently replaced timing belt, new oil and filters, and spark plugs. The car also has a valid ITV (inspection). These factors contribute to a high condition score.\n- Seller score: 80. The car is being sold by a private party, which can be either positive or negative depending on the buyer's preference. However, the seller has a high rating based on previous sales and reviews, which is a positive factor.\n- Features score: 70. The car is a basic gasoline model with manual transmission, which is not uncommon for this make and model. However, no additional features or equipment are mentioned, which negatively impacts the score.",
    "reference_price": "8.800 euros",
    "reference_kilometers": "75.000 - 115.000 km",
    "reference_year_range": "2012-2016"
  },
  {
    "model": "Peugeot 208",
    "url": "https://es.wallapop.com/item/peugeot-208-1-0-access-puretech-964714361",
    "score": 82,
    "price_score": 70,
    "mileage_score": 80,
    "year_score": 85,
    "condition_score": 85,
    "seller_score": 80,
    "features_score": 70,
    "explanation": "The car is a 2015 Peugeot 208 Sedan with 100,000 km, which is within the target range. The price of 7,700 euros is slightly lower than the reference price of 8,800 euros, hence the price score is 70. The mileage is on the higher end of the reference range (75,000 - 115,000 km), so the mileage score is 80. The car is stated to have its maintenance up-to-date and reconditioned, which is positive, hence the condition score is 85. The seller is a dealer, which is a plus, but not exceptional, so the seller score is 80. The car has basic features, but no notable additional features, so the features score is 70. Overall, the car receives a score of 82.",
    "reference_price": "8.800 euros",
    "reference_kilometers": "75.000 - 115.000 km",
    "reference_year_range": "2012-2016"
  },
  {
    "model": "Fiat 500",
    "url": "https://es.wallapop.com/item/fiat-500-2011-1056818207",
    "score": 82,
    "price_score": 85,
    "mileage_score": 80,
    "year_score": 85,
    "condition_score": 90,
    "seller_score": 70,
    "features_score": 75,
    "explanation": "The car received a high price score of 85 because it is listed for 7600 euros, which is lower than the reference price of 7900 euros. The mileage score is 80, as the car has 68,000 km, which is within the reference range of 60,000 - 100,000 km. The year score is 85 because the car is from 2011, which is within the target range of 2010-2014. The condition score is 90 because the car has been well-maintained, always parked indoors, and has a valid ITV (inspection) as of August 2024. The seller score is 70 because it is a private seller (Andrea N.), which may present some risk compared to a dealer. The features score is 75, as the car is a Fiat 500C cabrio with manual transmission and gasoline engine, which are desirable features.",
    "reference_price": "7.900 euros",
    "reference_kilometers": "60.000 - 100.000 km",
    "reference_year_range": "2010-2014"
  },
  {
    "model": "Peugeot 308",
    "url": "https://es.wallapop.com/item/peugeot-308-2019-1070501522",
    "score": 82,
    "price_score": 85,
    "mileage_score": 70,
    "year_score": 100,
    "condition_score": 80,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car received a high score for year as it is within the target range (2019). The price is also reasonable, given the reference range of 18.000 - 20.000 euros, and thus scored 85. However, the mileage is slightly higher than the reference (36000 km vs 35.000 km), so it scored 70. The overall condition and maintenance based on the description seem good, so it scored 80. The seller is a private party, which might require more caution, so it scored 70. The car has some additional features (automatic, 5 doors, 5 seats, gasoline) that added points to its score, resulting in 80 for features_score.",
    "reference_price": "18.000 - 20.000 euros",
    "reference_kilometers": "35.000 - 65.000 km",
    "reference_year_range": "2019-2021"
  },
  {
    "model": "Seat Ibiza",
    "url": "https://es.wallapop.com/item/seat-ibiza-fr-1069087562",
    "score": 80,
    "price_score": 70,
    "mileage_score": 80,
    "year_score": 80,
    "condition_score": 85,
    "seller_score": 80,
    "features_score": 85,
    "explanation": "The car is a 2012 Seat Ibiza FR with a manual transmission and diesel engine. It has 80,000 km, which is within the reference range. The price of 8,680 euros is slightly lower than the reference price, so the price score is 70. The mileage score is 80, as it is at the lower end of the reference range. The car is within the target year range, so the year score is 80. The description mentions that the vehicle has been revised and comes with a 12-month guarantee, which suggests that it is in good condition, so the condition score is 85. The seller is a dealer, which is a positive factor, so the seller score is 80. The car has additional features such as financing options and the possibility of leaving your current car as part of the payment, which adds to its appeal, so the features score is 85. The overall score is 80.",
    "reference_price": "8.700 euros",
    "reference_kilometers": "80.000 - 120.000 km",
    "reference_year_range": "2012-2016"
  },
  {
    "model": "Seat Ibiza",
    "url": "https://es.wallapop.com/item/seat-ibiza-2014-105cv-fr-1060435205",
    "score": 80,
    "price_score": 70,
    "mileage_score": 80,
    "year_score": 100,
    "condition_score": 85,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car is a 2014 SEAT Ibiza, which is within the target year range (2012-2016), so it gets a full score for year_score. The price of 8500 euros is slightly lower than the reference price of 8700 euros, so it gets a price_score of 70. The mileage of 103,000 km is within the reference range of 80,000 - 120,000 km, so it gets a mileage_score of 80. Based on the description, the car appears to be in good condition and has been well-maintained, so it gets a condition_score of 85. The car is being sold by a private party, which is a neutral factor in this case, so it gets a seller_score of 70. The car has some additional features such as a Garmin navigation system and new tires, which adds to its appeal, so it gets a features_score of 80. Overall, the car scores 80 out of 100.",
    "reference_price": "8.700 euros",
    "reference_kilometers": "80.000 - 120.000 km",
    "reference_year_range": "2012-2016"
  },
  {
    "model": "Opel Corsa",
    "url": "https://es.wallapop.com/item/opel-corsa-1-0-turbo-start-stop-excellence-1066158661",
    "score": 80,
    "price_score": 70,
    "mileage_score": 80,
    "year_score": 100,
    "condition_score": 70,
    "seller_score": 60,
    "features_score": 80,
    "explanation": "The car is a 2015 Opel Corsa with 93,824 km, which is within the target range and has a good mileage score. The price is slightly lower than the reference at 8,490 EUR, but it's for a financed purchase, so the actual price may be higher. The condition score is 70 as there is no detailed information about the overall condition and maintenance of the car. The seller is a dealer, which may affect the negotiation and final price. The car has a 1.0 Turbo engine, manual transmission, and 5 seats, which are positive features.",
    "reference_price": "8.500 euros",
    "reference_kilometers": "80.000 - 120.000 km",
    "reference_year_range": "2011-2015"
  },
  {
    "model": "Peugeot 208",
    "url": "https://es.wallapop.com/item/peugeot-208-5p-active-1-2l-puretech-110-1070293236",
    "score": 80,
    "price_score": 70,
    "mileage_score": 80,
    "year_score": 100,
    "condition_score": 70,
    "seller_score": 60,
    "features_score": 80,
    "explanation": "The car is being sold for 6,990 EUR, which is slightly below the reference price of 8,800 EUR, so it gets a 70 for price. The mileage is 110,638 km, which is within the reference range of 75,000 - 115,000 km, so it gets an 80 for mileage. The car is from the year 2016, which is within the target range of 2012-2016, so it gets a 100 for year. The condition of the car is good, but not excellent, based on the description, so it gets a 70 for condition. The car is being sold by a dealer, which is less favorable than being sold by a private party, so it gets a 60 for seller. The car has additional features and equipment, which is a positive, so it gets an 80 for features.",
    "reference_price": "8.800 euros",
    "reference_kilometers": "75.000 - 115.000 km",
    "reference_year_range": "2012-2016"
  },
  {
    "model": "Peugeot 208",
    "url": "https://es.wallapop.com/item/peugeot-208-5p-active-1-2l-puretech-82-1068311525",
    "score": 80,
    "price_score": 70,
    "mileage_score": 85,
    "year_score": 80,
    "condition_score": 80,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car is a 2015 Peugeot 208 with 104,045 km. The price of 7,990€ is slightly below the reference price of 8,800€, hence the price score is 70. The mileage is within the reference range of 75,000-115,000 km, so the mileage score is 85. The car's year is within the target range of 2012-2016, so the year score is 80. The overall condition and maintenance is based on the description, which seems to be in good condition, so the condition score is 80. The seller is a dealer, which may affect the negotiation and price, so the seller score is 70. The car comes with additional features and equipment, but it is not specified what they are, so the features score is 80. The final score is the average of all the scores, which is 80.",
    "reference_price": "8.800 euros",
    "reference_kilometers": "75.000 - 115.000 km",
    "reference_year_range": "2012-2016"
  },
  {
    "model": "Peugeot 208",
    "url": "https://es.wallapop.com/item/peugeot-208-5p-style-1-2l-puretech-82-1067691735",
    "score": 80,
    "price_score": 85,
    "mileage_score": 70,
    "year_score": 100,
    "condition_score": 75,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car received a score of 80 out of 100. The price is quite good, given that the listing price is lower than the reference price, which is why it received a high price score of 85. However, the mileage is slightly higher than the reference range, which is why it received a mileage score of 70. The car is within the target year range, so it received a perfect year score of 100. The condition and maintenance description is somewhat limited, but it seems to be in a decent condition, which is why it received a condition score of 75. The car is being sold by a dealer, which is why it received a seller score of 70. Lastly, the car has some additional features, which is why it received a features score of 80.",
    "reference_price": "8.800 euros",
    "reference_kilometers": "75.000 - 115.000 km",
    "reference_year_range": "2012-2016"
  },
  {
    "model": "Peugeot 208",
    "url": "https://es.wallapop.com/item/peugeot-208-puretech-110-sands-allure-81-kw-110-cv-1063012420",
    "score": 80,
    "price_score": 70,
    "mileage_score": 60,
    "year_score": 80,
    "condition_score": 85,
    "seller_score": 80,
    "features_score": 90,
    "explanation": "The car is a 2016 Peugeot 208 with 100,742 km, listed for 8,300 EUR. The price is slightly higher than the reference of 8,800 EUR, hence the price score is 70. The mileage is above the preferred range of 75,000-115,000 km, so the mileage score is 60. The car is within the target year range, so the year score is 80. The description suggests the car is in good condition and has been well-maintained, so the condition score is 85. The car is being sold by a dealer, which is a positive factor, so the seller score is 80. The car has several additional features, which is a significant plus, so the features score is 90. The overall score is 80.",
    "reference_price": "8.800 euros",
    "reference_kilometers": "75.000 - 115.000 km",
    "reference_year_range": "2012-2016"
  },
  {
    "model": "Peugeot 208",
    "url": "https://es.wallapop.com/item/peugeot-208-puretech-110-sands-allure-81-kw-110-cv-1062719313",
    "score": 80,
    "price_score": 70,
    "mileage_score": 60,
    "year_score": 80,
    "condition_score": 85,
    "seller_score": 80,
    "features_score": 90,
    "explanation": "The car being appraised is a 2016 Peugeot 208 PureTech 110 SANDS Allure with 100,742 km. The price of 8,300 EUR is a bit high compared to the reference of 8,800 EUR, hence the price score is 70. The mileage is slightly above the desired range of 75,000-115,000 km, so the mileage score is 60. The car is within the target year range, so the year score is 80. The overall condition and maintenance seem good based on the description, earning a condition score of 85. The seller is a dealer, which is a positive factor, so the seller score is 80. The car comes with several additional features and equipment, which is a significant plus, earning a features score of 90. The final score is 80.",
    "reference_price": "8.800 euros",
    "reference_kilometers": "75.000 - 115.000 km",
    "reference_year_range": "2012-2016"
  },
  {
    "model": "Peugeot 208",
    "url": "https://es.wallapop.com/item/peugeot-208-2012-1053220660",
    "score": 80,
    "price_score": 70,
    "mileage_score": 80,
    "year_score": 80,
    "condition_score": 85,
    "seller_score": 70,
    "features_score": 85,
    "explanation": "The car is a 2012 Peugeot 208 with 110,000 km, which is within the target range of 2012-2016. The price of 8,800 euros is slightly higher than the reference price, so the price score is 70. The mileage is on the higher end of the reference range (75,000-115,000 km), but still within the range, so the mileage score is 80. The year score is 80 as it is within the target range. The overall condition and maintenance of the car is described as well-maintained, with recent maintenance and new tires, so the condition score is 85. The car is being sold by a private party, which is a neutral factor, so the seller score is 70. The car has several additional features such as leather seats, electric windows and mirrors, bluetooth, and climate control, so the features score is 85. The final score is the average of all the individual scores, which is 80.",
    "reference_price": "8.800 euros",
    "reference_kilometers": "75.000 - 115.000 km",
    "reference_year_range": "2012-2016"
  },
  {
    "model": "Peugeot 208",
    "url": "https://es.wallapop.com/item/peugeot-208-1-4-hdi-business-line-50-kw-68-cv-1044347021",
    "score": 80,
    "price_score": 85,
    "mileage_score": 75,
    "year_score": 85,
    "condition_score": 80,
    "seller_score": 80,
    "features_score": 85,
    "explanation": "The car received a score of 80 out of 100. The price score is 85, as the car is offered at the reference price of 7900 EUR, which is a 57% discount compared to a new car. The mileage score is 75, with 77,180 km, which is slightly above the upper limit of the reference range. The year score is 85, as the car is from 2014, well within the target range. The condition score is 80, based on the description of a one-year warranty, a certificate of mileage and absence of structural damage, and the offer to appraise a trade-in vehicle. The seller score is 80, as it is a dealer, which can be a more reliable option than a private seller. The features score is 85, with highlighted equipment including cruise control, speed limiter, multifunction steering wheel, air conditioning, and Bluetooth connectivity.",
    "reference_price": "8.800 euros",
    "reference_kilometers": "75.000 - 115.000 km",
    "reference_year_range": "2012-2016"
  },
  {
    "model": "Toyota Yaris",
    "url": "https://es.wallapop.com/item/toyota-yaris-2015-1070559041",
    "score": 80,
    "price_score": 70,
    "mileage_score": 60,
    "year_score": 100,
    "condition_score": 85,
    "seller_score": 80,
    "features_score": 85,
    "explanation": "The car received a score of 80 out of 100. The price is slightly lower than the reference, so it got a 70. The mileage is a bit higher than the desired range, earning it a 60. The car is within the target year range, so it received a perfect score of 100. The description suggests good overall condition and maintenance, so it got an 85. The seller is a dealer, which is slightly less favorable than a private seller, hence the score of 80. The car has several additional features and equipment, which contributed to an 85.",
    "reference_price": "8.600 euros",
    "reference_kilometers": "70.000 - 110.000 km",
    "reference_year_range": "2011-2015"
  },
  {
    "model": "Fiat 500",
    "url": "https://es.wallapop.com/item/fiat-500c-1-2-by-diesel-8v-51-kw-69-cv-1070353768",
    "score": 80,
    "price_score": 70,
    "mileage_score": 75,
    "year_score": 80,
    "condition_score": 85,
    "seller_score": 80,
    "features_score": 85,
    "explanation": "The car received a score of 80 out of 100. The price score is 70, as the asking price of 7390 EUR is slightly below the reference price of 7900 EUR but still not very competitive. The mileage score is 75, as the car has 77437 km which is towards the higher end of the reference range of 60,000 - 100,000 km. The year score is 80, as the car is from 2011 which is within the target range of 2010-2014. The condition score is 85, as the car comes with a 1-year warranty, a certificate of kilometers and absence of structural damage, and it is overvalued in trade-ins. The seller score is 80, as the seller is a dealer which is slightly less favorable than a private seller. The features score is 85, as the car has several additional features such as a retractable roof, leather-fabric upholstery, multifunction steering wheel, parking assistance, air conditioning, bluetooth, power steering, isofix, and alloy wheels.",
    "reference_price": "7.900 euros",
    "reference_kilometers": "60.000 - 100.000 km",
    "reference_year_range": "2010-2014"
  },
  {
    "model": "Fiat 500",
    "url": "https://es.wallapop.com/item/alfa-romeo-mito-2011-1066460713",
    "score": 80,
    "price_score": 85,
    "mileage_score": 80,
    "year_score": 85,
    "condition_score": 85,
    "seller_score": 75,
    "features_score": 70,
    "explanation": "The car is a 2011 Alfa Romeo MiTO listed for 7500 euros, which is within the reference price range. The mileage is 79,000 km, which is slightly above the reference range but still acceptable. The car falls within the target year range of 2010-2014. The description suggests that the car is in excellent condition and has been well-maintained, with a new kit of distribution and 4 new tires. The car has a medioambiental C (green) distinction and passed the ITV with no defects. The seller is a private party, which may require more caution from the buyer. The car has manual transmission and 4 seats, with gasoline engine and 78 horsepower. Additional features are not explicitly mentioned, hence the lower score for features.",
    "reference_price": "7.900 euros",
    "reference_kilometers": "60.000 - 100.000 km",
    "reference_year_range": "2010-2014"
  },
  {
    "model": "Fiat 500",
    "url": "https://es.wallapop.com/item/fiat-500-1-2-8v-69-cv-lounge-1066395706",
    "score": 80,
    "price_score": 85,
    "mileage_score": 70,
    "year_score": 100,
    "condition_score": 80,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car received a score of 80 out of 100. The price score is 85, as it is 57% cheaper than a new one. The mileage score is 70, with 82,000 km, which is slightly above the reference range. The year score is 100, as it falls within the target range (2010-2014) and is from 2014. The condition score is 80, based on the description of a recent review and the inclusion of a name change and guarantee. The seller score is 70, as it is a dealer, which may have slightly higher prices than private sellers. The features score is 80, with the car having a pegatina medioambiental verde ('C') and low consumption.",
    "reference_price": "7.900 euros",
    "reference_kilometers": "60.000 - 100.000 km",
    "reference_year_range": "2010-2014"
  },
  {
    "model": "Seat León",
    "url": "https://es.wallapop.com/item/seat-leon-2-0-tdi-110kw-dsg-7-s-s-fr-go-xl-1070293029",
    "score": 80,
    "price_score": 70,
    "mileage_score": 80,
    "year_score": 100,
    "condition_score": 70,
    "seller_score": 60,
    "features_score": 80,
    "explanation": "The car being appraised is a Seat Leon 2.0 TDI 110kW DSG-7 S&S FR Go XL, located in Barcelona, with a price of 18,990€ after a promotion of financing 100% of the amount. The reference price range is between 18,500 - 20,500 euros, so the price is slightly below the range, giving it a score of 70. The mileage of the car is 46,226 km, which is within the reference range of 25,000 - 55,000 km, giving it a score of 80. The car is from the year 2021, which is within the target range of 2020-2022, giving it a score of 100. The overall condition and maintenance of the car, based on the description, is good but not excellent, giving it a score of 70. The seller is a dealer, which can affect the negotiation and final price, giving it a score of 60. The car has additional features and equipment, which adds value to the car, giving it a score of 80.",
    "reference_price": "18.500 - 20.500 euros",
    "reference_kilometers": "25.000 - 55.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Seat León",
    "url": "https://es.wallapop.com/item/seat-leon-1-5-tsi-110kw-150cv-st-sp-fr-1068973651",
    "score": 80,
    "price_score": 85,
    "mileage_score": 75,
    "year_score": 100,
    "condition_score": 80,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car received a score of 80 out of 100. The price is quite good, with a score of 85, as it's below the reference range. However, the mileage is slightly higher than the reference range, resulting in a score of 75. The car is within the target year range, earning a full score of 100. The overall condition and maintenance description seem decent, so the car gets an 80 for condition. The seller is a dealer, which lowers the score to 70. The car has some additional features, earning it an 80 for features.",
    "reference_price": "18.500 - 20.500 euros",
    "reference_kilometers": "25.000 - 55.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Seat León",
    "url": "https://es.wallapop.com/item/seat-leon-1-5-tsi-sands-fr-fast-edition-110-kw-150-cv-1067427593",
    "score": 80,
    "price_score": 70,
    "mileage_score": 80,
    "year_score": 100,
    "condition_score": 80,
    "seller_score": 85,
    "features_score": 85,
    "explanation": "The car received a score of 80 out of 100. The price is slightly above the reference range, hence the price score is 70. The mileage is within the reference range, so the mileage score is 80. The car is from the target year, so the year score is 100. The condition and maintenance description seem good, so the condition score is 80. The seller is a dealer, which is positive, so the seller score is 85. The car has several additional features, so the features score is 85.",
    "reference_price": "18.500 - 20.500 euros",
    "reference_kilometers": "25.000 - 55.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Seat León",
    "url": "https://es.wallapop.com/item/seat-leon-1-0-tsi-81kw-s-s-style-5-p-2022-1066372595",
    "score": 80,
    "price_score": 70,
    "mileage_score": 80,
    "year_score": 100,
    "condition_score": 75,
    "seller_score": 80,
    "features_score": 80,
    "explanation": "The car being appraised is a Seat Leon 1.0 TSI 81kW S&S Style with 5 seats and 5 doors, located in Barcelona, Spain. It has a manual transmission and runs on gasoline with 110 horsepower. The car was manufactured in 2022, which is within the target range and earns a full score for year.\nThe price of the car is 16,990 euros, which is lower than the reference price range of 18,500 - 20,500 euros. However, it is important to note that this price is an offer price for financing 100% of the import, subject to specific conditions of the promoting entities. Considering this, the price score is 70.\nThe mileage of the car is 31,000 km, which is lower than the reference range of 25,000 - 55,000 km. This earns a mileage score of 80.\nThe overall condition and maintenance of the car is described as good, but not detailed information is provided. Therefore, the condition score is 75.\nThe car is being sold by a dealer, Flexicar, which is a well-known and reputable dealership in Spain. This earns a seller score of 80.\nThe car comes with several additional features and equipment, including a 5-seat sedan with 5 doors, a manual transmission, and a gasoline engine. However, no other additional features are mentioned in the listing. Therefore, the features score is 80.\nOverall, the car receives a score of 80 out of 100.",
    "reference_price": "18.500 - 20.500 euros",
    "reference_kilometers": "25.000 - 55.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Seat León",
    "url": "https://es.wallapop.com/item/seat-leon-1-5-tsi-110kw-150cv-s-s-fr-black-ed-1066361656",
    "score": 80,
    "price_score": 70,
    "mileage_score": 80,
    "year_score": 100,
    "condition_score": 70,
    "seller_score": 80,
    "features_score": 70,
    "explanation": "The car being appraised is a Seat Leon 1.5 TSI 110kW (150CV) S&S FR Black Ed, located in Barcelona. The price of 18,990€ is slightly below the reference range of 18,500 - 20,500 euros, hence the price score is 70. The mileage of 34,000 km is within the reference range of 25,000 - 55,000 km, so the mileage score is 80. The car is from the year 2020, which is within the target range of 2020-2022, so the year score is 100. The overall condition and maintenance of the car is based on the description, and it seems to be in good condition, but without a detailed inspection, it's difficult to give a high score. Hence, the condition score is 70. The seller is a dealer, which is a positive factor, but not as good as a private seller with a known history of the car. Hence, the seller score is 80. The car has additional features and equipment, but it's not specified what they are, so it's difficult to give a high score. Hence, the features score is 70. The final score is the average of all the individual scores, which is 80.",
    "reference_price": "18.500 - 20.500 euros",
    "reference_kilometers": "25.000 - 55.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Seat León",
    "url": "https://es.wallapop.com/item/seat-leon-1-5-tsi-110kw-150cv-dsg-7-s-s-fr-ed-pl-1066178931",
    "score": 80,
    "price_score": 70,
    "mileage_score": 85,
    "year_score": 100,
    "condition_score": 70,
    "seller_score": 60,
    "features_score": 80,
    "explanation": "The car received a score of 80 out of 100. The price is 18.990 euros, which is slightly above the reference range, resulting in a price score of 70. The mileage is 25140 km, which is better than the reference range, earning a mileage score of 85. The car is from the year 2020, which is within the target range, resulting in a year score of 100. The overall condition and maintenance are described as good, but not exceptional, giving it a condition score of 70. The seller is a dealer, which is slightly less favorable than a private seller, earning a seller score of 60. The car has additional features such as automatic transmission and a specific FR Ed Pl trim, contributing to a features score of 80.",
    "reference_price": "18.500 - 20.500 euros",
    "reference_kilometers": "25.000 - 55.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Seat León",
    "url": "https://es.wallapop.com/item/tu-seat-leon-de-ocasion-1066131344",
    "score": 80,
    "price_score": 70,
    "mileage_score": 80,
    "year_score": 100,
    "condition_score": 80,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car received a score of 80 out of 100. The price of 18,900 euros is slightly above the reference range, so it got a 70 for price. The mileage of 40,000 km is within the reference range, so it received an 80 for mileage. The car is from 2020, which is within the target range, so it got a perfect score of 100 for year. Based on the description, the overall condition and maintenance of the car seem good, so it received an 80 for condition. The car is being sold by a dealer, which is slightly less favorable than a private seller, so it got a 70 for seller. The car has additional features and equipment, which contributed to an 80 for features. Overall, the car appears to be a good choice within the specified criteria.",
    "reference_price": "18.500 - 20.500 euros",
    "reference_kilometers": "25.000 - 55.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Seat León",
    "url": "https://es.wallapop.com/item/seat-leon-st-1-5-ecotsi-sands-fr-fast-edition-plus-dsg-110-kw-150-cv-1060305406",
    "score": 80,
    "price_score": 70,
    "mileage_score": 80,
    "year_score": 100,
    "condition_score": 75,
    "seller_score": 85,
    "features_score": 85,
    "explanation": "The car received a score of 80 out of 100. The price score is 70, as the offer price of 18,636 EUR is slightly below the reference range, but the cash price of 20,500 EUR is at the higher end. The mileage score is 80, as the car has 45,474 km, which is within the reference range. The year score is 100, as the car is from 2020, well within the target range. The condition score is 75, based on the description mentioning a guaranteed 1-year warranty, a certification of kilometers and absence of structural damage, and a trade-in valuation. The seller score is 85, as it is a dealer (OCASIONPLUS) with a strong presence in the market. The features score is 85, as the car has several desirable features, such as a navigation system, Car Play, a rearview camera, LED headlights and taillights, rain and light sensors, adaptive cruise control, climate control, and alloy wheels.",
    "reference_price": "18.500 - 20.500 euros",
    "reference_kilometers": "25.000 - 55.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Seat León",
    "url": "https://es.wallapop.com/item/seat-leon-st-1-5-tsi-sands-style-go-96-kw-130-cv-1047331819",
    "score": 80,
    "price_score": 70,
    "mileage_score": 80,
    "year_score": 100,
    "condition_score": 80,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car received a score of 80 out of 100. The price is slightly below the reference range, hence the price score is 70. The mileage is within the reference range, so the mileage score is 80. The car is from 2021, which is ideal, so the year score is 100. The condition and maintenance description seem good, so the condition score is 80. The seller is a dealer, not a private party, so the seller score is 70. The car has some additional features, which contributed to the features score being 80.",
    "reference_price": "18.500 - 20.500 euros",
    "reference_kilometers": "25.000 - 55.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Ford Puma",
    "url": "https://es.wallapop.com/item/ford-puma-1-0-ecoboost-92kw-125cv-st-line-1066371732",
    "score": 80,
    "price_score": 70,
    "mileage_score": 80,
    "year_score": 100,
    "condition_score": 75,
    "seller_score": 80,
    "features_score": 80,
    "explanation": "The car received a score of 80 out of 100. The price is slightly below the reference range, hence the price score of 70. The mileage is within the reference range, so the mileage score is 80. The car is of the correct year, so the year score is 100. The condition and maintenance information provided in the description are good, but not exceptional, so the condition score is 75. The seller is a dealer, which is a positive factor, but not exceptional, so the seller score is 80. The car has additional features (4x4, manual, etc.), which contribute to the features score of 80.",
    "reference_price": "19.500 - 21.500 euros",
    "reference_kilometers": "20.000 - 50.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Ford Puma",
    "url": "https://es.wallapop.com/item/ford-puma-1-0-ecoboost-92kw-125cv-titanium-auto-1066174248",
    "score": 80,
    "price_score": 70,
    "mileage_score": 60,
    "year_score": 100,
    "condition_score": 80,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car is listed at 17,990 EUR, which is slightly below the reference range (19,500 - 21,500 EUR), so it gets a 70 for price. The mileage is 48,000 km, which is above the reference range (20,000 - 50,000 km), so it gets a 60 for mileage. The car is from 2021, which is within the target range (2020-2022), so it gets a 100 for year. Based on the description, the overall condition and maintenance of the car seems good, so it gets an 80 for condition. The car is being sold by a dealer, so it gets a 70 for seller. The car has some additional features like 4x4 and automatic transmission, so it gets an 80 for features.",
    "reference_price": "19.500 - 21.500 euros",
    "reference_kilometers": "20.000 - 50.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Ford Puma",
    "url": "https://es.wallapop.com/item/ford-puma-1-0-ecoboost-125cv-st-line-mhev-1066092082",
    "score": 80,
    "price_score": 70,
    "mileage_score": 80,
    "year_score": 100,
    "condition_score": 70,
    "seller_score": 60,
    "features_score": 80,
    "explanation": "The car is listed for 15,890 euros, which is slightly below the reference range (65/100). The mileage is 40,600 km, which is within the reference range (80/100). The car is from the year 2021, which is within the target range (100/100). The description does not provide much information about the overall condition and maintenance, so I am giving it a moderate score (70/100). The seller is a dealer, which may affect the negotiation and final price (60/100). The car has additional features such as 4x4, electric, and manual transmission, which adds value to the car (80/100).",
    "reference_price": "19.500 - 21.500 euros",
    "reference_kilometers": "20.000 - 50.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Peugeot 308",
    "url": "https://es.wallapop.com/item/peugeot-308-5p-gt-line-1-2-puretech-96kw-130-auto-1066342009",
    "score": 80,
    "price_score": 70,
    "mileage_score": 80,
    "year_score": 100,
    "condition_score": 70,
    "seller_score": 80,
    "features_score": 70,
    "explanation": "The car is being sold for 14,290 EUR with financing, which is slightly below the reference range of 18,000 - 20,000 EUR, hence the price score is 70. The mileage of 39,700 km is within the reference range of 35,000 - 65,000 km, so the mileage score is 80. The car is from the year 2019, which is within the target range of 2019-2021, so the year score is 100. The description does not provide much information about the condition and maintenance of the car, so the condition score is 70. The seller is a dealer, which is a positive factor, so the seller score is 80. The car has automatic transmission and 130 horsepower, which are standard features and do not provide any additional value, so the features score is 70.",
    "reference_price": "18.000 - 20.000 euros",
    "reference_kilometers": "35.000 - 65.000 km",
    "reference_year_range": "2019-2021"
  },
  {
    "model": "Peugeot 308",
    "url": "https://es.wallapop.com/item/peugeot-308-sw-active-pack-sands-puretech-96-kw-130-cv-1027627922",
    "score": 80,
    "price_score": 70,
    "mileage_score": 60,
    "year_score": 100,
    "condition_score": 85,
    "seller_score": 80,
    "features_score": 90,
    "explanation": "The car received a score of 80 out of 100. The price is slightly lower than the reference range, hence the price score is 70. The mileage is higher than the preferred range, so the mileage score is 60. The car is of the correct year, so the year score is 100. The condition and maintenance description sounds good, so the condition score is 85. The seller is a dealer, which is good, but not a private seller, so the seller score is 80. The car has many additional features, which is why the features score is 90.",
    "reference_price": "18.000 - 20.000 euros",
    "reference_kilometers": "35.000 - 65.000 km",
    "reference_year_range": "2019-2021"
  },
  {
    "model": "Citroën C4 Grand Spacetourer",
    "url": "https://es.wallapop.com/item/citroen-grand-c4-spacetourer-puretech-96kw-130cv-s-s-6v-feel-1066095580",
    "score": 80,
    "price_score": 70,
    "mileage_score": 85,
    "year_score": 80,
    "condition_score": 80,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car received a score of 80 out of 100. The price score is 70, as the asking price of 13,580 EUR with financing is within the reference range but closer to the lower end. The mileage score is 85, as the car has 47,000 km, which is on the lower end of the reference range. The year score is 80, as the car is from 2018, near the beginning of the target range. The condition score is 80, based on the description mentioning it's in good condition and has a clean history. The seller score is 70, as the seller is a dealer, which may result in less flexibility and potentially higher costs compared to a private seller. The features score is 80, as the car has a decent list of equipment, including manual transmission and 7 seats.",
    "reference_price": "19.000 - 21.000 euros",
    "reference_kilometers": "40.000 - 70.000 km",
    "reference_year_range": "2018-2020"
  },
  {
    "model": "Seat Ibiza",
    "url": "https://es.wallapop.com/item/seat-ibiza-fr-1069087510",
    "score": 78,
    "price_score": 70,
    "mileage_score": 80,
    "year_score": 80,
    "condition_score": 75,
    "seller_score": 85,
    "features_score": 80,
    "explanation": "The car received a score of 78 out of 100. The price score is 70, as the car is listed for 8,680 EUR, which is about 57% cheaper than a new one, but still higher than the reference price of 8,700 EUR. The mileage score is 80, as the car has 80,000 km, which is within the target range of 80,000 - 120,000 km. The year score is 80, as the car is from 2012, which is within the target range of 2012-2016. The condition score is 75, based on the description of the car being revisado and with a garantía de 12 meses, but no specific mention of maintenance or overall condition. The seller score is 85, as the car is sold by a dealer, which is more reliable than a private seller. The features score is 80, as the car has additional features such as financing options and the possibility of leaving your car as part of the payment.",
    "reference_price": "8.700 euros",
    "reference_kilometers": "80.000 - 120.000 km",
    "reference_year_range": "2012-2016"
  },
  {
    "model": "Seat Ibiza",
    "url": "https://es.wallapop.com/item/seat-ibiza-1-2-85cv-edicion-especial-30-aniversari-1058197853",
    "score": 78,
    "price_score": 60,
    "mileage_score": 70,
    "year_score": 80,
    "condition_score": 85,
    "seller_score": 80,
    "features_score": 75,
    "explanation": "The car received a score of 78 out of 100. The price score is 60, as the asking price of 6,800 euros is lower than the reference price of 8,700 euros. However, it is still significantly higher than the average price for a car with this mileage and year. The mileage score is 70, as the car has 114,000 km, which is slightly higher than the reference range of 80,000 - 120,000 km. The year score is 80, as the car is from 2014, which is within the target range of 2012-2016. The condition score is 85, as the car is described as being in 'perfect' condition, with a recent ITV (inspection), new front tires, and up-to-date maintenance. The seller score is 80, as the car is being sold by a private party, which can be a good or bad thing depending on the situation. The features score is 75, as the car has a decent list of standard features, but no notable extras.",
    "reference_price": "8.700 euros",
    "reference_kilometers": "80.000 - 120.000 km",
    "reference_year_range": "2012-2016"
  },
  {
    "model": "Seat Ibiza",
    "url": "https://es.wallapop.com/item/seat-ibiza-2014-1029137173",
    "score": 78,
    "price_score": 80,
    "mileage_score": 70,
    "year_score": 80,
    "condition_score": 85,
    "seller_score": 70,
    "features_score": 60,
    "explanation": "The car received a score of 78 out of 100. The price score is 80, as the car is 57% cheaper than a new one. However, it is still priced higher than the reference price of 8700 euros. The mileage score is 70 because, although it falls within the target range of 80,000-120,000 km, the car has 112,000 km, which is closer to the upper limit. The year score is 80, as the car is from 2014, which is within the target range of 2012-2016. The condition score is 85, as the seller mentions that the car has been well-maintained, with several parts replaced in March 2023. The seller score is 70, as it is a private seller, which may require more effort from the buyer's side. The features score is 60, as the car has standard features and no notable extras.",
    "reference_price": "8.700 euros",
    "reference_kilometers": "80.000 - 120.000 km",
    "reference_year_range": "2012-2016"
  },
  {
    "model": "Seat Ibiza",
    "url": "https://es.wallapop.com/item/seat-ibiza-2012-1022516305",
    "score": 78,
    "price_score": 85,
    "mileage_score": 70,
    "year_score": 80,
    "condition_score": 85,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car received a price score of 85 because it is 57% cheaper than a new one. The mileage score is 70 as it is slightly above the reference range. The year score is 80 because it is within the target range. The condition score is 85 because the car is described as being in very good condition with recent maintenance. The seller score is 70 because it is a private sale, which may not offer the same protections as a dealer. The features score is 80 because it has some additional features like air conditioning, new tires, and a spare tire.",
    "reference_price": "8.700 euros",
    "reference_kilometers": "80.000 - 120.000 km",
    "reference_year_range": "2012-2016"
  },
  {
    "model": "Seat Ibiza",
    "url": "https://es.wallapop.com/item/seat-ibiza-1-2-12v-70cv-reference-1009944290",
    "score": 78,
    "price_score": 60,
    "mileage_score": 80,
    "year_score": 80,
    "condition_score": 85,
    "seller_score": 70,
    "features_score": 75,
    "explanation": "The car is a 2013 Seat Ibiza with 81,000 km, which are within the reference range. The price of 7,990 euros is a bit lower than the reference price of 8,700 euros, hence the price score is 60. The mileage score is 80 as it's within the reference range. The car is one year younger than the ideal range, but still acceptable, so the year score is 80. The condition of the car seems good based on the description, earning a score of 85. The seller is a dealer, hence the seller score is 70. The car comes with a good set of standard features, earning it a features score of 75. Overall score is 78.",
    "reference_price": "8.700 euros",
    "reference_kilometers": "80.000 - 120.000 km",
    "reference_year_range": "2012-2016"
  },
  {
    "model": "Ford Focus",
    "url": "https://es.wallapop.com/item/ford-focus-1-0-ecoboost-auto-start-stop-100cv-trend-1069426809",
    "score": 78,
    "price_score": 70,
    "mileage_score": 60,
    "year_score": 80,
    "condition_score": 80,
    "seller_score": 80,
    "features_score": 80,
    "explanation": "The car received a score of 78 out of 100. The price score is 70, as the asking price of 8900 euros is slightly below the reference price of 9200 euros. However, it is still on the lower end of the price range for this model. The mileage score is 60, because 108,000 km is above the reference range of 90,000 - 140,000 km. The year score is 80, as the car is from 2014, which is within the target range of 2011-2015. The condition score is 80, based on the description mentioning that the car has recently had a service check and includes a 12-month warranty. The seller score is 80, because it is a dealership, which is considered more reliable than a private seller. The features score is 80, because the car has a good amount of standard equipment, including a manual transmission, air conditioning, and a radio.",
    "reference_price": "9.200 euros",
    "reference_kilometers": "90.000 - 140.000 km",
    "reference_year_range": "2011-2015"
  },
  {
    "model": "Renault Clio",
    "url": "https://es.wallapop.com/item/renault-clio-iv-air-1-5-dci-75cv-bvm5-e6-vehiculo-comercial-1068521225",
    "score": 78,
    "price_score": 60,
    "mileage_score": 80,
    "year_score": 80,
    "condition_score": 75,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car is a 2016 Renault Clio with 70,437 km, which are within the reference range. The price of 6,200 euros is lower than the reference price, but not significantly. The overall condition and maintenance seem good based on the description, but there are no details provided about specific checks or inspections. The seller is a dealer, which can be a positive or negative factor depending on the buyer's preference. The car has additional features and equipment, which adds value to the vehicle.",
    "reference_price": "8.900 euros",
    "reference_kilometers": "70.000 - 110.000 km",
    "reference_year_range": "2013-2017"
  },
  {
    "model": "Opel Corsa",
    "url": "https://es.wallapop.com/item/opel-corsa-2014-861127482",
    "score": 78,
    "price_score": 65,
    "mileage_score": 70,
    "year_score": 85,
    "condition_score": 80,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car received a score of 78 out of 100. The price score is 65, as the asking price of 6000 euros is lower than the reference price of 8500 euros. However, it might be too low considering the car's condition, mileage, and additional features. The mileage score is 70, as the car has 89,000 km, which is slightly higher than the desired range of 80,000-120,000 km. The year score is 85, as the car is from 2014, well within the target range of 2011-2015. The condition score is 80, based on the description mentioning the car is in good condition, recently serviced, and has passed its ITV (inspection). The seller score is 70, as it is a private sale, which can sometimes present more risks than a dealer sale. The features score is 80, as the car has several desirable features, such as a rear parking sensor, GPS, Bluetooth, air conditioning, and a rearview tinted window.",
    "reference_price": "8.500 euros",
    "reference_kilometers": "80.000 - 120.000 km",
    "reference_year_range": "2011-2015"
  },
  {
    "model": "Renault Megane",
    "url": "https://es.wallapop.com/item/renault-megane-2010-1-6-16v-1069868660",
    "score": 78,
    "price_score": 80,
    "mileage_score": 70,
    "year_score": 80,
    "condition_score": 85,
    "seller_score": 70,
    "features_score": 70,
    "explanation": "The car received a score of 78 out of 100. The price score is 80, as the car is 57% cheaper than a new one. The mileage score is 70 because the car has 118,000 km, which is slightly higher than the reference range. The year score is 80, as the car is from 2010, within the target range. The condition score is 85, as the car has been well-maintained, with a recent distribution and ITV. The seller score is 70, as it's a private seller. The features score is 70, as the car has basic features and equipment.",
    "reference_price": "9.100 euros",
    "reference_kilometers": "100.000 - 150.000 km",
    "reference_year_range": "2010-2014"
  },
  {
    "model": "Renault Megane",
    "url": "https://es.wallapop.com/item/renault-megane-2014-1033279123",
    "score": 78,
    "price_score": 65,
    "mileage_score": 80,
    "year_score": 85,
    "condition_score": 70,
    "seller_score": 70,
    "features_score": 75,
    "explanation": "The car received a score of 78 out of 100. The price score is 65, which is below average (9.100 euros reference price) as the car is listed at 8500 euros. The mileage score is 80, which is above average (125000 km vs 100.000 - 150.000 km reference range). The year score is 85, which is above average (2014 vs 2010-2014 reference range). The condition score is 70, based on the description mentioning that the car has had regular maintenance and has some extras. The seller score is 70, as it is a dealer (MC CAR C.) but they have a taller propio (own workshop). The features score is 75, as the car has a manual transmission, 5 seats, and 5 doors, which are standard features for this model.",
    "reference_price": "9.100 euros",
    "reference_kilometers": "100.000 - 150.000 km",
    "reference_year_range": "2010-2014"
  },
  {
    "model": "Peugeot 208",
    "url": "https://es.wallapop.com/item/peugeot-208-5p-style-1-2l-puretech-82-1070290317",
    "score": 78,
    "price_score": 70,
    "mileage_score": 80,
    "year_score": 80,
    "condition_score": 75,
    "seller_score": 80,
    "features_score": 80,
    "explanation": "The car is listed at 9,900 euros, which is slightly lower than the reference price of 8,800 euros. However, considering the market fluctuations and possible additional costs, the price score is 70. The mileage is 80,000 km, which is within the target range and better than the reference, so the mileage score is 80. The car is from 2014, which is within the target range, so the year score is 80. The overall condition and maintenance are described as good, but not excellent, so the condition score is 75. The seller is a private party, which is a positive factor, so the seller score is 80. The car has some additional features, such as a sunroof and leather seats, which adds to the features score, making it 80. The total score is the average of all the individual scores, which is 78.",
    "reference_price": "8.800 euros",
    "reference_kilometers": "75.000 - 115.000 km",
    "reference_year_range": "2012-2016"
  },
  {
    "model": "Peugeot 208",
    "url": "https://es.wallapop.com/item/peugeot-208-2015-1066850435",
    "score": 78,
    "price_score": 65,
    "mileage_score": 70,
    "year_score": 80,
    "condition_score": 85,
    "seller_score": 70,
    "features_score": 70,
    "explanation": "The car is a 2015 Peugeot 208 with 79,000 km, which is slightly above the desired mileage range of 75,000-115,000 km. The price of 7,700 EUR is lower than the reference price of 8,800 EUR, but considering the mileage, the price score is 65. The car's year is within the target range, so it gets a full score for that criterion. The overall condition and maintenance based on the description seem good, so it gets a high score for condition. The seller is a dealer, which slightly lowers the score compared to a private seller. The car has a 1-year warranty and the possibility of financing, which are positive features, but not unique or particularly valuable for this model. Therefore, the features score is 70.",
    "reference_price": "8.800 euros",
    "reference_kilometers": "75.000 - 115.000 km",
    "reference_year_range": "2012-2016"
  },
  {
    "model": "Peugeot 208",
    "url": "https://es.wallapop.com/item/peugeot-208-2015-1066845713",
    "score": 78,
    "price_score": 65,
    "mileage_score": 80,
    "year_score": 85,
    "condition_score": 75,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car received a score of 78 out of 100. Here's the breakdown: \n- Price score: 65. The asking price of 6,900 EUR is lower than the reference price of 8,800 EUR, which is a positive factor. However, it's still significantly higher than the average price for a 2015 Peugeot 208, which is around 5,500 EUR, so it's not a great deal. \n- Mileage score: 80. With 97,000 km, the car has higher mileage than the reference range of 75,000 - 115,000 km, but it's still within an acceptable range for a 7-year-old car. \n- Year score: 85. The car's model year of 2015 is within the target range of 2012-2016. \n- Condition score: 75. The car is described as having been thoroughly inspected and receiving a 1-year warranty from the seller, which is a positive sign. However, there's no mention of any recent maintenance or repairs, so it's unclear if the car is in excellent condition. \n- Seller score: 70. The seller is a dealer, which is generally a more reliable option than a private seller, but the fact that they're a used car dealership specializing in online sales may raise some concerns about their reputation and customer service. \n- Features score: 80. The car has a manual transmission and 5 doors, which are standard features for this model. There's no mention of any additional features or equipment, but the car is described as having low CO2 emissions, which is a positive factor.",
    "reference_price": "8.800 euros",
    "reference_kilometers": "75.000 - 115.000 km",
    "reference_year_range": "2012-2016"
  },
  {
    "model": "Peugeot 208",
    "url": "https://es.wallapop.com/item/peugeot-208-1-4-hdi-business-line-50-kw-68-cv-1044761944",
    "score": 78,
    "price_score": 60,
    "mileage_score": 70,
    "year_score": 80,
    "condition_score": 85,
    "seller_score": 80,
    "features_score": 80,
    "explanation": "The car received a score of 78 out of 100. The price score is 60, as the asking price of 7900 EUR is slightly lower than the reference price of 8800 EUR. The mileage score is 70, as the car has 77,180 km, which is within the reference range but closer to the higher end. The year score is 80, as the car is from 2014, well within the target range of 2012-2016. The condition score is 85, based on the description mentioning a 1-year warranty, a certification of kilometers and absence of structural damage, and the offer to appraise a trade-in vehicle. The seller score is 80, as the seller appears to be a dealership (OCASIONPLUS M.) with multiple locations. The features score is 80, as the car has several desirable features, such as a speed limiter, Bluetooth, and air conditioning.",
    "reference_price": "8.800 euros",
    "reference_kilometers": "75.000 - 115.000 km",
    "reference_year_range": "2012-2016"
  },
  {
    "model": "Peugeot 208",
    "url": "https://es.wallapop.com/item/seat-ibiza-2014-1029137173",
    "score": 78,
    "price_score": 60,
    "mileage_score": 70,
    "year_score": 80,
    "condition_score": 85,
    "seller_score": 70,
    "features_score": 70,
    "explanation": "The car received a score of 78 out of 100. The price score is 60 out of 100, as the car is listed for 6699 euros, which is significantly lower than the reference price of 8800 euros. However, the price might be lower due to higher mileage. The mileage score is 70 out of 100, as the car has 112,000 km, which is slightly higher than the reference range of 75,000 to 115,000 km. The year score is 80 out of 100, as the car is from 2014, which is within the target range of 2012-2016. The condition score is 85 out of 100, as the seller states that the car has been well-maintained, with a recent service in March 2023, where several parts were replaced. The seller score is 70 out of 100, as the seller is a private party, which can be a positive or negative factor depending on the buyer's preference. The features score is 70 out of 100, as the car has a manual transmission and 3 doors, which might not be to everyone's liking.",
    "reference_price": "8.800 euros",
    "reference_kilometers": "75.000 - 115.000 km",
    "reference_year_range": "2012-2016"
  },
  {
    "model": "Citroën C3",
    "url": "https://es.wallapop.com/item/citroen-c3-2013-1069213625",
    "score": 78,
    "price_score": 70,
    "mileage_score": 80,
    "year_score": 80,
    "condition_score": 85,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car received a price score of 70 because its asking price of 5900 euros is lower than the reference price of 8300 euros. However, it's still significantly higher than the price financed of 5600 euros, which might indicate some room for negotiation. The mileage score is 80 as the car has 98052 kilometers, which is within the reference range of 80,000 - 120,000 km. The year score is 80 since the car is from 2013, which is within the target range of 2011-2015. The condition score is 85 because the description indicates that the vehicle is in good condition, has passed its ITV (inspection) without defects, and comes with a one-year warranty. The seller score is 70 because it's being sold by a dealership (NaldoCars), which might imply additional costs. Finally, the features score is 80 because the car has several desirable features, such as air conditioning, central locking, isofix, onboard computer, and is fully finançable.",
    "reference_price": "8.300 euros",
    "reference_kilometers": "80.000 - 120.000 km",
    "reference_year_range": "2011-2015"
  },
  {
    "model": "Citroën C3",
    "url": "https://es.wallapop.com/item/citroen-c3-puretech-60kw-82cv-tonic-1066338916",
    "score": 78,
    "price_score": 70,
    "mileage_score": 80,
    "year_score": 100,
    "condition_score": 70,
    "seller_score": 60,
    "features_score": 70,
    "explanation": "The car is a 2015 Citroën C3 with 113279 km, which is within the target year range and has mileage slightly below the reference range. The price is 5990 euros, which is lower than the reference price of 8300 euros. However, it's important to note that this price is for a specific financing offer and the actual price may be higher. The car's condition is described as good, but there are no detailed maintenance records provided. The seller is a dealer, which may affect the negotiation and final price. The car has standard features for a C3, but no additional equipment is mentioned.",
    "reference_price": "8.300 euros",
    "reference_kilometers": "80.000 - 120.000 km",
    "reference_year_range": "2011-2015"
  },
  {
    "model": "Fiat 500",
    "url": "https://es.wallapop.com/item/fiat-500c-1-2-by-diesel-8v-51-kw-69-cv-1069743892",
    "score": 78,
    "price_score": 60,
    "mileage_score": 70,
    "year_score": 80,
    "condition_score": 85,
    "seller_score": 80,
    "features_score": 85,
    "explanation": "The car received a score of 78 out of 100. The price score is 60, as the asking price of 7390 EUR is lower than the reference price of 7900 EUR. However, it is not significantly cheaper, hence the moderate score. The mileage score is 70, as the car has 77437 km, which is slightly higher than the reference range of 60,000-100,000 km. The year score is 80, as the car is from 2011, which is within the target range of 2010-2014. The condition score is 85, based on the description mentioning a one-year warranty, a certificate of kilometers and absence of structural damage, and overvaluing customer's cars in trade-ins. The seller score is 80, as it is a dealer (Ocasionplus), which is slightly better than a private seller. The features score is 85, as the car has several desirable equipment, such as a retractable roof, leather-fabric upholstery, multifunction steering wheel, parking assistance, air conditioning, Bluetooth, power steering, Isofix, and alloy wheels.",
    "reference_price": "7.900 euros",
    "reference_kilometers": "60.000 - 100.000 km",
    "reference_year_range": "2010-2014"
  },
  {
    "model": "Seat León",
    "url": "https://es.wallapop.com/item/seat-leon-style-go-1068870782",
    "score": 78,
    "price_score": 80,
    "mileage_score": 60,
    "year_score": 100,
    "condition_score": 70,
    "seller_score": 80,
    "features_score": 85,
    "explanation": "The car received a score of 78 out of 100. The price is reasonable and scored 80, being below the reference range. However, the mileage of 37168 km is higher than the reference range, which lowered its score to 60. The car is within the target year range, so it received a perfect score of 100 for the year. The overall condition and maintenance are good based on the description, so it scored 70. The car is being sold by a dealer, which is better than a private sale, so it scored 80. The car has several additional features and equipment, which increased its score to 85.",
    "reference_price": "18.500 - 20.500 euros",
    "reference_kilometers": "25.000 - 55.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Seat León",
    "url": "https://es.wallapop.com/item/seat-leon-sp-1-4-e-hybrid-dsg-s-s-fr-go-xl-1066356606",
    "score": 78,
    "price_score": 60,
    "mileage_score": 80,
    "year_score": 100,
    "condition_score": 70,
    "seller_score": 60,
    "features_score": 80,
    "explanation": "The car received a score of 78 out of 100. The price is 1.490€ higher than the reference range, hence the price score is 60. The mileage is within the reference range, so the mileage score is 80. The car is of the correct year, so the year score is 100. The condition of the car is good but not excellent based on the description, so the condition score is 70. The seller is a dealer, hence the seller score is 60. The car has additional features and equipment, so the features score is 80.",
    "reference_price": "18.500 - 20.500 euros",
    "reference_kilometers": "25.000 - 55.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Seat León",
    "url": "https://es.wallapop.com/item/seat-leon-st-1-5-tsi-s-s-fr-150-1066298376",
    "score": 78,
    "price_score": 70,
    "mileage_score": 60,
    "year_score": 100,
    "condition_score": 80,
    "seller_score": 85,
    "features_score": 70,
    "explanation": "The car received a score of 78 out of 100. The price of 18,900€ is slightly above the reference range (18,500 - 20,500 euros), resulting in a price score of 70. The mileage of 44,020 km is a bit higher than the reference range (25,000 - 55,000 km), leading to a mileage score of 60. The car is from the target year 2020, earning a perfect year score of 100. The overall condition and maintenance description seem good, so the condition score is 80. The seller is a dealer, which is positive, earning a score of 85. The car has a few additional features, leading to a features score of 70.",
    "reference_price": "18.500 - 20.500 euros",
    "reference_kilometers": "25.000 - 55.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Seat León",
    "url": "https://es.wallapop.com/item/seat-leon-1-0-tsi-81kw-s-s-style-5-p-2022-1064576214",
    "score": 78,
    "price_score": 70,
    "mileage_score": 60,
    "year_score": 100,
    "condition_score": 80,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car received a score of 78 out of 100. The price is 90% of the reference range, so the price score is 70. The mileage is 56,000 km out of a possible 55,000 km, so the mileage score is 60. The car is within the target year range, so the year score is 100. The condition of the car is good based on the description, so the condition score is 80. The car is being sold by a dealer, so the seller score is 70. The car has additional features, so the features score is 80.",
    "reference_price": "18.500 - 20.500 euros",
    "reference_kilometers": "25.000 - 55.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Seat León",
    "url": "https://es.wallapop.com/item/seat-leon-st-1-5-ecotsi-sands-style-edition-96-kw-130-cv-1042806793",
    "score": 78,
    "price_score": 60,
    "mileage_score": 70,
    "year_score": 100,
    "condition_score": 75,
    "seller_score": 80,
    "features_score": 85,
    "explanation": "The car received a score of 78 out of 100. The price score is 60 because the offering price of 15,591 EUR is below the reference range of 18,500 - 20,500 EUR. However, the price is higher than the non-financed price of 17,150 EUR. The mileage score is 70 because the car has 45,154 km, which is higher than the reference range of 25,000 - 55,000 km. The year score is 100 since the car is from 2020, within the target range of 2020-2022. The condition score is 75 based on the provided description mentioning a clean history, one owner, and a 1-year warranty. The seller score is 80 as a dealer, OCASIONPLUS M., is selling the car. The features score is 85 due to the presence of several additional features such as Car Play, rearview camera, automatic headlights, parking assistant, rain sensor, start/stop system, speed limiter, climate control, multifunction steering wheel, Bluetooth, and alloy wheels.",
    "reference_price": "18.500 - 20.500 euros",
    "reference_kilometers": "25.000 - 55.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Seat León",
    "url": "https://es.wallapop.com/item/seat-leon-1-0-tsi-sands-reference-go-66-kw-90-cv-1041532000",
    "score": 78,
    "price_score": 60,
    "mileage_score": 65,
    "year_score": 85,
    "condition_score": 80,
    "seller_score": 70,
    "features_score": 85,
    "explanation": "The car received a score of 78 out of 100. The price score is 60, as the offering price of 17,264 EUR is slightly below the reference range. However, the price al contado of 18,990 EUR is above the reference range. The mileage score is 65, as the 32,086 km is towards the higher end of the reference range. The year score is 85, as the car is from 2021, well within the target range. The condition score is 80, based on the description of a single owner, a full service history, and a 1-year warranty. The seller score is 70, as it is a dealer. The features score is 85, as the car has several desirable features such as CarPlay, LED headlights and taillights, automatic headlights, electronic parking brake, cruise control, speed limiter, multifunction steering wheel, push-button start, air conditioning, Bluetooth, and Isofix.",
    "reference_price": "18.500 - 20.500 euros",
    "reference_kilometers": "25.000 - 55.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Seat León",
    "url": "https://es.wallapop.com/item/seat-leon-1-5-tgi-gnc-sands-fr-fast-edition-dsg-96-kw-130-cv-1034073971",
    "score": 78,
    "price_score": 60,
    "mileage_score": 50,
    "year_score": 100,
    "condition_score": 80,
    "seller_score": 70,
    "features_score": 85,
    "explanation": "The car received a score of 78 out of 100. The price is 7% below the reference range, resulting in a price score of 60. The mileage is higher than the reference range, leading to a mileage score of 50. The car is within the target year range, earning a year score of 100. The overall condition and maintenance are good based on the description, resulting in a condition score of 80. The seller is a dealer, which is less favorable than a private seller, so the seller score is 70. The car has several additional features and equipment, earning it a features score of 85.",
    "reference_price": "18.500 - 20.500 euros",
    "reference_kilometers": "25.000 - 55.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Seat León",
    "url": "https://es.wallapop.com/item/seat-leon-st-2-0-tdi-style-go-85-kw-115-cv-1023500322",
    "score": 78,
    "price_score": 70,
    "mileage_score": 60,
    "year_score": 85,
    "condition_score": 80,
    "seller_score": 75,
    "features_score": 85,
    "explanation": "The car received a score of 78 out of 100. The price is slightly below the reference range, which earns it a 70. The mileage is a bit higher than the reference range, so it gets a 60. The car is within the target year range, giving it a perfect 85. The condition and maintenance are described as good, so it gets an 80. The seller is a dealer, which is better than a private seller but not by much, so it gets a 75. The car has some additional features, which earns it an 85.",
    "reference_price": "18.500 - 20.500 euros",
    "reference_kilometers": "25.000 - 55.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Seat León",
    "url": "https://es.wallapop.com/item/seat-leon-2021-994076842",
    "score": 78,
    "price_score": 70,
    "mileage_score": 60,
    "year_score": 100,
    "condition_score": 85,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car received a high year score (100) as it is within the target range (2020-2022) with the model year being 2021. The price score (70) is slightly below average because the asking price of 17,000 EUR is lower than the reference range (18,500 - 20,500 EUR). However, it is important to consider the mileage and condition of the vehicle when evaluating the price. The mileage score (60) is lower than average due to the higher-than-reference mileage of 34,000 km. The overall condition and maintenance score (85) is quite good based on the description, as the vehicle is said to be in perfect condition and has a one-year official SEAT warranty. The seller score (70) is average because the seller is a dealership (IJ Instaladors M.) with 27 sales and 8 ratings, which indicates some experience but not extensive history in selling vehicles. The features score (80) is above average because the car has a desirable 5-door, 5-seat layout, and is a familiar version of the SEAT Leon with a 130 horsepower gasoline engine and manual transmission.",
    "reference_price": "18.500 - 20.500 euros",
    "reference_kilometers": "25.000 - 55.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Seat León",
    "url": "https://es.wallapop.com/item/seat-leon-2021-958755286",
    "score": 78,
    "price_score": 70,
    "mileage_score": 60,
    "year_score": 100,
    "condition_score": 80,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car is a 2021 SEAT Leon with a price of 19,500 EUR, which is slightly below the reference range of 18,500 - 20,500 EUR, hence a price score of 70. The mileage of 37,000 km is a bit higher than the reference range of 25,000 - 55,000 km, so a mileage score of 60. The car is within the target year range, so it gets a full score of 100 for year. The condition is described as 'perfect', but there is no mention of maintenance, so a condition score of 80. The seller is a private party, which is slightly less reliable than a dealer, so a seller score of 70. The car comes with several additional features, including Android Auto, Apple Carplay, rear parking aid, rear camera, climate control, cruise control, and more, so a features score of 80. Overall, the car gets a score of 78.",
    "reference_price": "18.500 - 20.500 euros",
    "reference_kilometers": "25.000 - 55.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Ford Puma",
    "url": "https://es.wallapop.com/item/ford-puma-1-0-ecoboost-mhev-st-line-x-design-114-kw-155-cv-1070047976",
    "score": 78,
    "price_score": 60,
    "mileage_score": 50,
    "year_score": 100,
    "condition_score": 80,
    "seller_score": 85,
    "features_score": 90,
    "explanation": "The car received a score of 78 out of 100. The price score is 60 because the offering price of 19,000 EUR is at the lower end of the reference range, but it's important to consider that the price is subject to financing and the price al contado (cash price) is higher. The mileage score is 50 due to the higher mileage of 45,242 km, which is closer to the lower end of the reference range. The year score is 100 as the car is from 2022, well within the target range. The condition score is 80 based on the description mentioning a national car, single owner, and a full year warranty. The seller score is 85 as a dealer (OCASIONPLUS) is selling the car. The features score is 90 because the car has many desirable features such as a navigation system, rearview camera, LED headlights, and a leather-fabric interior.",
    "reference_price": "19.500 - 21.500 euros",
    "reference_kilometers": "20.000 - 50.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Ford Puma",
    "url": "https://es.wallapop.com/item/ford-puma-1-0-ecoboost-mhev-st-line-x-design-114-kw-155-cv-1070041371",
    "score": 78,
    "price_score": 60,
    "mileage_score": 70,
    "year_score": 100,
    "condition_score": 80,
    "seller_score": 80,
    "features_score": 85,
    "explanation": "The car received a score of 100 for year because it is within the target range (2020-2022) and is a 2022 model. The price score is 60 because the listing price of 19,000 EUR is below the reference price range of 19,500 - 21,500 EUR. However, the price is not significantly lower than the reference range, so the score is not very high. The mileage score is 70 because the car has 45,242 km, which is above the reference range of 20,000 - 50,000 km. The condition score is 80 because the description mentions that the car has a clean history, a full one-year warranty, and a certificate of kilometers and absence of structural damage. The seller score is 80 because the car is being sold by a dealer, which is generally more reliable than a private seller. The features score is 85 because the car has a number of desirable features, such as leather-fabric upholstery, heated seats, a heated steering wheel, a sport suspension, a navigation system, a rearview camera, LED headlights and taillights, a rain sensor, automatic headlights, a start/stop system, a speed limiter, a lane departure warning system, a Bluetooth connection, and alloy wheels.",
    "reference_price": "19.500 - 21.500 euros",
    "reference_kilometers": "20.000 - 50.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Ford Puma",
    "url": "https://es.wallapop.com/item/ford-puma-1-0-ecoboost-125cv-titanium-design-mhev-1066354505",
    "score": 78,
    "price_score": 70,
    "mileage_score": 60,
    "year_score": 100,
    "condition_score": 80,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car received a score of 78 out of 100. The price is 16,690 EUR, which is slightly below the reference range, earning a score of 70. The mileage is 46,780 km, a bit higher than the reference range, resulting in a score of 60. The car is from 2021, which is within the target range, so it gets a perfect score of 100. The overall condition and maintenance based on the description seem good, earning a score of 80. The seller is a dealer, so it gets a score of 70. The car has additional features such as 4x4, electric, and manual transmission, which earns it a score of 80.",
    "reference_price": "19.500 - 21.500 euros",
    "reference_kilometers": "20.000 - 50.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Ford Puma",
    "url": "https://es.wallapop.com/item/ford-puma-1-0-ecoboost-mhev-st-line-design-auto-92-kw-125-cv-1060306192",
    "score": 78,
    "price_score": 60,
    "mileage_score": 70,
    "year_score": 100,
    "condition_score": 80,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car received a score of 78 out of 100. The price score is 60, as the offering price of 20,455 EUR is slightly lower than the reference range but the cash price is above the range. The mileage score is 70, as the car has 27,227 km which is near the higher end of the reference range. The year score is 100, as the car is from 2022 which is within the target range. The condition score is 80, based on the description of one owner, a full 1-year warranty, and a certificate of kilometers and absence of structural damage. The seller score is 70, as it is a dealer but no information about their reputation is provided. The features score is 80, as the car has several additional features like sport package, Car Play, rear camera, lane assist, traffic sign recognition, and more.",
    "reference_price": "19.500 - 21.500 euros",
    "reference_kilometers": "20.000 - 50.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Ford Puma",
    "url": "https://es.wallapop.com/item/ford-puma-1-0-ecoboost-mhev-st-line-design-auto-92-kw-125-cv-1060306004",
    "score": 78,
    "price_score": 60,
    "mileage_score": 70,
    "year_score": 80,
    "condition_score": 85,
    "seller_score": 75,
    "features_score": 80,
    "explanation": "The car received a score of 78 out of 100. The price is 27,455 EUR, which is above the reference range of 19,500 - 21,500 EUR, resulting in a price score of 60. The mileage is 27,227 km, which is within the reference range of 20,000 - 50,000 km, resulting in a mileage score of 70. The car is from the year 2022, which is within the target range of 2020-2022, resulting in a year score of 80. The overall condition and maintenance of the car is described as good, resulting in a condition score of 85. The car is being sold by a dealer, resulting in a seller score of 75. The car has several additional features and equipment, resulting in a features score of 80.",
    "reference_price": "19.500 - 21.500 euros",
    "reference_kilometers": "20.000 - 50.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Ford Puma",
    "url": "https://es.wallapop.com/item/ford-puma-2021-1019582827",
    "score": 78,
    "price_score": 60,
    "mileage_score": 70,
    "year_score": 100,
    "condition_score": 80,
    "seller_score": 70,
    "features_score": 85,
    "explanation": "The car received a score of 78 out of 100. The price is 60 out of 100, as it is slightly below the reference range. The mileage is 70 out of 100, being on the higher end of the reference range. The year is 100 out of 100, as it is within the target range. The condition score is 80 out of 100, based on the description of a recent review at 30,000 km and additional features. The seller score is 70 out of 100, being a private seller. The features score is 85 out of 100, as it has several additional features such as a sunroof, painted in metallic white, supportive front seats, alloy wheels, and more.",
    "reference_price": "19.500 - 21.500 euros",
    "reference_kilometers": "20.000 - 50.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Peugeot 308",
    "url": "https://es.wallapop.com/item/peugeot-308-5p-allure-1-2-puretech-81kw-110cv-1069666648",
    "score": 78,
    "price_score": 70,
    "mileage_score": 80,
    "year_score": 100,
    "condition_score": 70,
    "seller_score": 60,
    "features_score": 70,
    "explanation": "The car is being sold for 10.490€, which is below the reference price range of 18.000 - 20.000 euros, hence the price score is 70. The mileage of 64501 km is within the reference range of 35.000 - 65.000 km, so the mileage score is 80. The car is from the year 2019, which is within the target range of 2019-2021, so the year score is 100. The description does not provide much information about the condition and maintenance of the car, so the condition score is 70. The seller is a dealer, which might affect the negotiation flexibility and personal touch, so the seller score is 60. The car has a manual transmission and comes with some features, but no standout equipment, so the features score is 70. Overall, the car is a decent choice, but the price and seller type might be potential drawbacks.",
    "reference_price": "18.000 - 20.000 euros",
    "reference_kilometers": "35.000 - 65.000 km",
    "reference_year_range": "2019-2021"
  },
  {
    "model": "Peugeot 308",
    "url": "https://es.wallapop.com/item/peugeot-308-5p-allure-pack-puretech-110-s-s-1067695723",
    "score": 78,
    "price_score": 70,
    "mileage_score": 80,
    "year_score": 100,
    "condition_score": 70,
    "seller_score": 60,
    "features_score": 70,
    "explanation": "The car is a 2021 model, which is great and within the target range, so it gets a full score for the year. The mileage is 60732 km, which is slightly lower than the reference range of 35,000 - 65,000 km, so it gets a high score for mileage. However, the price of 11,490 euros is lower than the reference range of 18,000 - 20,000 euros, which is why it gets a lower score for price. The description does not provide much information about the condition of the car, but it does mention that it has a manual transmission and a gasoline engine with 110 horsepower. It's being sold by a dealer, which may affect the negotiation and final price. The car also has some additional features, such as the Allure Pack and PureTech 110 S&S, but it's unclear if these are standard or optional features. Overall, the car gets a decent score, but there are some areas for improvement.",
    "reference_price": "18.000 - 20.000 euros",
    "reference_kilometers": "35.000 - 65.000 km",
    "reference_year_range": "2019-2021"
  },
  {
    "model": "Peugeot 308",
    "url": "https://es.wallapop.com/item/peugeot-308-5p-gt-line-1-2-puretech-96kw-130cv-1066374161",
    "score": 78,
    "price_score": 70,
    "mileage_score": 80,
    "year_score": 100,
    "condition_score": 70,
    "seller_score": 60,
    "features_score": 70,
    "explanation": "The car received a score of 78 out of 100. The price score is 70, as the car is listed for 11,990 EUR, which is below the reference range of 18,000 - 20,000 EUR. However, the price is still lower than the average market price due to the ongoing promotion. The mileage score is 80, as the car has 53,228 km, which is within the reference range of 35,000 - 65,000 km. The year score is 100, as the car is from 2019, which is within the target range of 2019-2021. The condition score is 70, as the description does not provide much information about the overall condition and maintenance of the car. The seller score is 60, as the car is being sold by a dealer, which may result in higher prices compared to private sellers. The features score is 70, as the car has standard features and equipment.",
    "reference_price": "18.000 - 20.000 euros",
    "reference_kilometers": "35.000 - 65.000 km",
    "reference_year_range": "2019-2021"
  },
  {
    "model": "Peugeot 308",
    "url": "https://es.wallapop.com/item/peugeot-308-5p-gt-line-1-2-puretech-96kw-130cv-1066365368",
    "score": 78,
    "price_score": 70,
    "mileage_score": 80,
    "year_score": 100,
    "condition_score": 70,
    "seller_score": 60,
    "features_score": 70,
    "explanation": "The car received a score of 78 out of 100. The price score is 70, as the offering price of 12.490€ is below the reference range of 18.000 - 20.000 euros. However, it is important to note that this price might be a promotion or a financed price. The mileage score is 80, as the car has 43488 km, which is within the reference range of 35.000 - 65.000 km. The year score is 100, as the car is from 2019, well within the target range of 2019-2021. The condition score is 70, based on the description, which does not provide specific details about the car's condition or maintenance. The seller score is 60, as it is a dealer, which might imply higher prices compared to private sellers. The features score is 70, as the car has a reasonable set of features and equipment, but no extraordinary ones.",
    "reference_price": "18.000 - 20.000 euros",
    "reference_kilometers": "35.000 - 65.000 km",
    "reference_year_range": "2019-2021"
  },
  {
    "model": "Peugeot 308",
    "url": "https://es.wallapop.com/item/peugeot-308-sw-allure-1-2-puretech-96kw-130cv-1066351924",
    "score": 78,
    "price_score": 70,
    "mileage_score": 80,
    "year_score": 100,
    "condition_score": 70,
    "seller_score": 60,
    "features_score": 80,
    "explanation": "The car is being sold for 9,990 EUR, which is slightly below the reference range of 18,000 - 20,000 EUR, hence the price score is 70. The mileage of 61,036 km is within the reference range of 35,000 - 65,000 km, so the mileage score is 80. The car is from the year 2019, which is within the target range of 2019-2021, so the year score is 100. The description does not provide much information about the condition and maintenance of the car, so the condition score is 70. The car is being sold by a dealer, which is a disadvantage compared to being sold by a private party, so the seller score is 60. The car has several additional features and equipment, which is a plus, so the features score is 80.",
    "reference_price": "18.000 - 20.000 euros",
    "reference_kilometers": "35.000 - 65.000 km",
    "reference_year_range": "2019-2021"
  },
  {
    "model": "Peugeot 308",
    "url": "https://es.wallapop.com/item/peugeot-308-5p-tech-edition-puretech-130-s-s-eat8-1066183075",
    "score": 78,
    "price_score": 70,
    "mileage_score": 80,
    "year_score": 100,
    "condition_score": 70,
    "seller_score": 60,
    "features_score": 70,
    "explanation": "The car is being offered at a price of 12,990 EUR, which is slightly below the reference range of 18,000 - 20,000 EUR, so it gets a score of 70 for price. The mileage of 60,173 km is within the reference range of 35,000 - 65,000 km, so it gets a score of 80 for mileage. The car is from the year 2020, which is within the target range of 2019-2021, so it gets a score of 100 for year. The overall condition and maintenance of the car is described as good, but not great, so it gets a score of 70 for condition. The seller is a dealer, which is not ideal, so it gets a score of 60 for seller. The car has some additional features and equipment, but not many, so it gets a score of 70 for features.",
    "reference_price": "18.000 - 20.000 euros",
    "reference_kilometers": "35.000 - 65.000 km",
    "reference_year_range": "2019-2021"
  },
  {
    "model": "Peugeot 308",
    "url": "https://es.wallapop.com/item/peugeot-308-sw-puretech-130-sands-gt-line-eat8-96-kw-130-cv-985264680",
    "score": 78,
    "price_score": 60,
    "mileage_score": 70,
    "year_score": 100,
    "condition_score": 80,
    "seller_score": 85,
    "features_score": 80,
    "explanation": "The car received a score of 78 out of 100. The price score is 60, as the offering price of 15,545 EUR is slightly lower than the reference range, but the non-financed price of 17,099 EUR is higher. The mileage score is 70, as the car has 50,840 km, which is a bit above the reference range. The year score is 100, as the car is from 2019, well within the target range. The condition score is 80, based on the description mentioning one owner, full maintenance history, and a one-year warranty. The seller score is 85, as it is a dealer, which is generally considered more reliable than a private seller. The features score is 80, as the car has several desirable features such as a navigation system, rearview camera, parking assistance, lane maintenance assistance, LED headlights and taillights, climate control, electric parking brake, push-button start, Bluetooth, and alloy wheels.",
    "reference_price": "18.000 - 20.000 euros",
    "reference_kilometers": "35.000 - 65.000 km",
    "reference_year_range": "2019-2021"
  },
  {
    "model": "Peugeot 308",
    "url": "https://es.wallapop.com/item/peugeot-308-sw-puretech-130-sands-gt-line-eat8-96-kw-130-cv-985264153",
    "score": 78,
    "price_score": 60,
    "mileage_score": 70,
    "year_score": 100,
    "condition_score": 80,
    "seller_score": 85,
    "features_score": 80,
    "explanation": "The car received a score of 78 out of 100. The price score is 60 because the offering price of 15,545 EUR is lower than the reference range, but it's the financed price, and the actual price is 17,099 EUR which is slightly above the reference range. The mileage score is 70 because the car has 50,840 km, which is above the upper limit of the reference range. The year score is 100, as the car is from 2019, well within the target range. The condition score is 80, based on the description mentioning a single owner, full maintenance history, and a 1-year warranty. The seller score is 85, as it's a dealer with a good reputation (OCASIONPLUS). The features score is 80, as the car has several desirable features like a navigator, rearview camera, parking assistance, lane-keeping assist, LED headlights and taillights, climate control, electric parking brake, Bluetooth, and alloy wheels.",
    "reference_price": "18.000 - 20.000 euros",
    "reference_kilometers": "35.000 - 65.000 km",
    "reference_year_range": "2019-2021"
  },
  {
    "model": "Citroën C4 Grand Spacetourer",
    "url": "https://es.wallapop.com/item/citroen-grand-c4-spacetourer-puretech-96kw-130cv-s-s-6v-c-series-5-p-2020-1066359455",
    "score": 78,
    "price_score": 70,
    "mileage_score": 60,
    "year_score": 100,
    "condition_score": 80,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car received a score of 78 out of 100. The price is 14,490 EUR, which is below the reference range, but the car has higher mileage (62447 km) compared to the reference range (40,000 - 70,000 km). The car is within the target year range (2020), and the description suggests that it is in good condition with regular maintenance. The seller is a dealer, and the car has additional features such as a manual transmission and a 131 horsepower engine. However, the mileage and price slightly lowered the overall score.",
    "reference_price": "19.000 - 21.000 euros",
    "reference_kilometers": "40.000 - 70.000 km",
    "reference_year_range": "2018-2020"
  },
  {
    "model": "Citroën C4 Grand Spacetourer",
    "url": "https://es.wallapop.com/item/citroen-grand-c4-spacetourer-puretech-96kw-130cv-s-s-6v-feel-1066348262",
    "score": 78,
    "price_score": 70,
    "mileage_score": 80,
    "year_score": 85,
    "condition_score": 75,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car is a 2018 model, which is within the target range, and has a mileage of 52,629 km, which is better than the reference range. The price of 12,970 EUR when financing 100% of the amount is slightly below the reference range, but the original price of 14,470 EUR is above the reference range. The overall condition and maintenance information provided in the description is limited, so it's difficult to give a high score. The seller is a dealer, which could affect the negotiation flexibility and price. The car has some additional features and equipment, which adds to its value.",
    "reference_price": "19.000 - 21.000 euros",
    "reference_kilometers": "40.000 - 70.000 km",
    "reference_year_range": "2018-2020"
  },
  {
    "model": "Seat Ibiza",
    "url": "https://es.wallapop.com/item/seat-ibiza-2014-1064290289",
    "score": 75,
    "price_score": 65,
    "mileage_score": 70,
    "year_score": 80,
    "condition_score": 75,
    "seller_score": 80,
    "features_score": 70,
    "explanation": "The car is a 2014 SEAT Ibiza diesel model with manual transmission and 5 doors. It has 106,000 km, which is slightly above the reference range of 80,000-120,000 km, hence a score of 70. The car is within the target year range of 2012-2016, so it gets a score of 80. The price of the car is 6,500 euros, which is significantly lower than the reference price of 8,700 euros, hence a score of 65. The car's condition is described as good, with regular maintenance done at SEAT official centers. However, there are some minor cosmetic damages due to city parking and carrying bicycles on the roof. Therefore, the condition score is 75. The car is being sold by a private party, which is a good sign, so the seller score is 80. The car has no additional features or equipment mentioned, so the features score is 70. Overall, the car gets a score of 75.",
    "reference_price": "8.700 euros",
    "reference_kilometers": "80.000 - 120.000 km",
    "reference_year_range": "2012-2016"
  },
  {
    "model": "Opel Corsa",
    "url": "https://es.wallapop.com/item/opel-corsa-2014-1060325142",
    "score": 75,
    "price_score": 80,
    "mileage_score": 70,
    "year_score": 85,
    "condition_score": 75,
    "seller_score": 70,
    "features_score": 70,
    "explanation": "The car received a score of 75 out of 100. The price score is 80, as it is 57% cheaper than a new one. The mileage score is 70, as it is slightly below the reference range. The year score is 85, as it falls within the target range. The condition score is 75, based on the description provided. The seller score is 70, as it is a private seller. The features score is 70, as no additional features or equipment are mentioned.",
    "reference_price": "8.500 euros",
    "reference_kilometers": "80.000 - 120.000 km",
    "reference_year_range": "2011-2015"
  },
  {
    "model": "Renault Megane",
    "url": "https://es.wallapop.com/item/renault-megane-sport-tourer-business-1-5-dci-1066243250",
    "score": 75,
    "price_score": 60,
    "mileage_score": 70,
    "year_score": 80,
    "condition_score": 75,
    "seller_score": 80,
    "features_score": 70,
    "explanation": "The car is a 2014 Renault Megane Sport Tourer with 120383 km, priced at 7499 euros. The price is slightly lower than the reference price (9100 euros) but still above the average for similar cars with higher mileage. The mileage is within the target range but on the higher end, which slightly lowers the score. The car is 7 years old, which is within the target range and earns a good score. The description suggests that the car is in good condition and has been well-maintained, earning a good condition score. The seller is a dealer, which earns a good score for reliability and accountability. The car has a diesel engine and manual transmission, which are standard features and do not add or detract from the score. Overall, the car earns a score of 75 out of 100.",
    "reference_price": "9.100 euros",
    "reference_kilometers": "100.000 - 150.000 km",
    "reference_year_range": "2010-2014"
  },
  {
    "model": "Peugeot 208",
    "url": "https://es.wallapop.com/item/peugeot-208-2015-1057732214",
    "score": 75,
    "price_score": 60,
    "mileage_score": 80,
    "year_score": 100,
    "condition_score": 70,
    "seller_score": 70,
    "features_score": 70,
    "explanation": "The car received a score of 75. The price is 60 out of 100, as it is priced lower than the reference price of 8,800 euros, but still not significantly cheaper considering the mileage. The mileage is 80 out of 100, as it is within the target range but closer to the higher end. The year score is 100, as the car is from 2015, well within the target range of 2012-2016. The condition score is 70 out of 100, as the car has been well-maintained but there are some minor issues mentioned in the description. The seller score is 70, as it is a private sale. The features score is 70 out of 100, as the car has some additional features but nothing exceptional.",
    "reference_price": "8.800 euros",
    "reference_kilometers": "75.000 - 115.000 km",
    "reference_year_range": "2012-2016"
  },
  {
    "model": "Peugeot 308",
    "url": "https://es.wallapop.com/item/peugeot-308-5p-allure-pack-bluehdi-130-s-s-eat8-1066340578",
    "score": 75,
    "price_score": 60,
    "mileage_score": 80,
    "year_score": 100,
    "condition_score": 70,
    "seller_score": 60,
    "features_score": 80,
    "explanation": "The car is a 2021 model, which is within the target range, and it has a mileage of 54110 km, which is better than the reference range. However, the price of 15.490€ is higher than the reference range of 18.000 - 20.000 euros, resulting in a lower price score. The overall condition and maintenance of the car is good, based on the description, but not exceptional, which is reflected in the condition score. The car is being sold by a dealer, which is a neutral factor in the scoring. The car has additional features and equipment, which is a positive factor in the scoring.",
    "reference_price": "18.000 - 20.000 euros",
    "reference_kilometers": "35.000 - 65.000 km",
    "reference_year_range": "2019-2021"
  },
  {
    "model": "Renault Clio E-Tech Híbrido",
    "url": "https://es.wallapop.com/item/renault-clio-2020-1067036567",
    "score": 75,
    "price_score": 60,
    "mileage_score": 70,
    "year_score": 100,
    "condition_score": 80,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car is a 2020 model, which is within the target range, so it gets a full score for the year. The mileage is 35,000 km, which is higher than the reference range of 15,000-45,000 km, so it gets a score of 70. The price of the car is 16,800 euros, which is lower than the reference range of 19,500-21,500 euros, so it gets a score of 60. The car's overall condition and maintenance is described as well-maintained and with all services up to date, so it gets a score of 80. The car is being sold by a private party, which is a neutral factor, so it gets a score of 70. The car has several additional features such as navigation, rear camera, and ambient lighting, so it gets a score of 80.",
    "reference_price": "19.500 - 21.500 euros",
    "reference_kilometers": "15.000 - 45.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Seat Ibiza",
    "url": "https://es.wallapop.com/item/seat-ibiza-reference-tech-1069571422",
    "score": 72,
    "price_score": 60,
    "mileage_score": 70,
    "year_score": 80,
    "condition_score": 75,
    "seller_score": 80,
    "features_score": 65,
    "explanation": "The car received a score of 72 out of 100. The price score is 60, as the asking price of 7,990 EUR is lower than the reference price of 8,700 EUR but still significantly higher than the median price of a similar used car. The mileage score is 70 because the car has 90,906 km, which is slightly above the reference range of 80,000-120,000 km. The year score is 80, as the car is from 2013, which is within the target range of 2012-2016. The condition score is 75, based on the description of the car being in 'almost new' condition and having a 4-year warranty. The seller score is 80, as the seller is a dealer, which typically indicates a higher level of reliability and accountability. The features score is 65, as the car has some additional features like air conditioning and turning signals, but lacks other features that are common in this model.",
    "reference_price": "8.700 euros",
    "reference_kilometers": "80.000 - 120.000 km",
    "reference_year_range": "2012-2016"
  },
  {
    "model": "Seat Ibiza",
    "url": "https://es.wallapop.com/item/seat-ibiza-st-1-6-tdi-style-dpf-77-kw-105-cv-1069078781",
    "score": 72,
    "price_score": 60,
    "mileage_score": 70,
    "year_score": 80,
    "condition_score": 75,
    "seller_score": 80,
    "features_score": 75,
    "explanation": "The car is a 2012 SEAT Ibiza ST with 109,379 km. The price of 8,300 EUR is slightly lower than the reference price of 8,700 EUR, hence the price score is 60. The mileage is a bit higher than the reference range of 80,000-120,000 km, so the mileage score is 70. The car's age is within the target range, so the year score is 80. The overall condition and maintenance are described as good, and the car comes with a 1-year warranty and a certificate of kilometers and absence of structural damage, hence the condition score is 75. The car is sold by a dealer, which is positive, so the seller score is 80. The car has some additional features such as control of velocity, air conditioning, Isofix, and alloy wheels, so the features score is 75. The total score is the average of the above scores, which is 72.",
    "reference_price": "8.700 euros",
    "reference_kilometers": "80.000 - 120.000 km",
    "reference_year_range": "2012-2016"
  },
  {
    "model": "Seat Ibiza",
    "url": "https://es.wallapop.com/item/seat-ibiza-st-1-6-tdi-style-dpf-77-kw-105-cv-1068742937",
    "score": 72,
    "price_score": 60,
    "mileage_score": 70,
    "year_score": 80,
    "condition_score": 75,
    "seller_score": 80,
    "features_score": 75,
    "explanation": "The car received a score of 72 out of 100. The price score is 60, as the car is listed at the same price as the reference (8,700 euros), which might be slightly high considering the mileage. The mileage score is 70, as it is slightly above the reference range (109,379 km vs 80,000-120,000 km). The year score is 80, as the car is within the target range (2012). The condition score is 75, based on the description that mentions a guarantee of one year and a certificate of kilometers and absence of structural damage. The seller score is 80, as it is a dealer, which is generally more reliable than a private seller. The features score is 75, as the car has some additional features like control of speed, air conditioning, Isofix, and alloy wheels.",
    "reference_price": "8.700 euros",
    "reference_kilometers": "80.000 - 120.000 km",
    "reference_year_range": "2012-2016"
  },
  {
    "model": "Seat Ibiza",
    "url": "https://es.wallapop.com/item/opel-corsa-2014-1048795352",
    "score": 72,
    "price_score": 60,
    "mileage_score": 65,
    "year_score": 80,
    "condition_score": 70,
    "seller_score": 80,
    "features_score": 75,
    "explanation": "The car is a 2014 Opel Corsa with 101,000 km, which is slightly above the desired mileage range. The price of 5,350 EUR is significantly lower than the reference price of 8,700 EUR, but given the higher mileage and some wear on the body, the price score is 60. The car's year is within the target range, so it gets a perfect score for that criterion. The condition of the car, based on the description, is good but not excellent, with some scratches on the bodywork. This results in a condition score of 70. The car is being sold by a private party, which is a positive factor, so the seller score is 80. The car has several additional features, including air conditioning, navigation, Bluetooth, electric mirrors, and others, which contributes to a features score of 75.",
    "reference_price": "8.700 euros",
    "reference_kilometers": "80.000 - 120.000 km",
    "reference_year_range": "2012-2016"
  },
  {
    "model": "Seat Ibiza",
    "url": "https://es.wallapop.com/item/seat-ibiza-2016-980046855",
    "score": 72,
    "price_score": 80,
    "mileage_score": 60,
    "year_score": 100,
    "condition_score": 70,
    "seller_score": 80,
    "features_score": 70,
    "explanation": "The car received a high score for year because it is within the target range (2016). The price score is 80 because it is 57% cheaper than a new one. However, the mileage is a bit high at 112,000 km, so it received a score of 60. The car's condition is described as well-maintained, so it received a score of 70. The car is being sold by a private party, which is good, so it received a score of 80. The car has an automatic transmission and 5 doors, which are desirable features, so it received a score of 70 for features.",
    "reference_price": "8.700 euros",
    "reference_kilometers": "80.000 - 120.000 km",
    "reference_year_range": "2012-2016"
  },
  {
    "model": "Ford Focus",
    "url": "https://es.wallapop.com/item/ford-focus-2013-1067050894",
    "score": 72,
    "price_score": 60,
    "mileage_score": 70,
    "year_score": 80,
    "condition_score": 70,
    "seller_score": 70,
    "features_score": 70,
    "explanation": "The car is a 2013 Ford Focus with 124,000 km, which is within the target range. The price of 7,599 euros is lower than the reference price of 9,200 euros, but not significantly, hence the price score is 60. The mileage is slightly above the target range but not by much, so the mileage score is 70. The car is a couple of years older than the ideal range, but still within a reasonable range, so the year score is 80. The description does not provide much information about the condition or maintenance, so the condition score is 70. The seller is a used car dealer, which is not ideal but not the worst, so the seller score is 70. The car has some additional features such as Bluetooth, AUX, and air conditioning, which adds to its value, so the features score is 70. Overall, the car is a decent option, but not exceptional, hence the score is 72.",
    "reference_price": "9.200 euros",
    "reference_kilometers": "90.000 - 140.000 km",
    "reference_year_range": "2011-2015"
  },
  {
    "model": "Renault Clio",
    "url": "https://es.wallapop.com/item/opel-corsa-2014-1048795352",
    "score": 72,
    "price_score": 65,
    "mileage_score": 60,
    "year_score": 80,
    "condition_score": 70,
    "seller_score": 80,
    "features_score": 75,
    "explanation": "The car is a 2014 Opel Corsa with 101,000 km. The price of 5,350€ is significantly lower than the reference price of 8,900€, hence the price score is 65. The mileage is higher than the reference range of 70,000-110,000 km, so the mileage score is 60. The car falls within the target year range, so the year score is 80. The condition of the car is described as 'very good' with some minor scratches, hence the condition score is 70. The seller is a private party, which is a positive factor, so the seller score is 80. The car has several additional features, which contributes to a features score of 75. The overall score is 72.",
    "reference_price": "8.900 euros",
    "reference_kilometers": "70.000 - 110.000 km",
    "reference_year_range": "2013-2017"
  },
  {
    "model": "Opel Corsa",
    "url": "https://es.wallapop.com/item/opel-corsa-2014-1048795352",
    "score": 72,
    "price_score": 60,
    "mileage_score": 60,
    "year_score": 80,
    "condition_score": 70,
    "seller_score": 80,
    "features_score": 80,
    "explanation": "The car is a 2014 Opel Corsa with 101,000 km. The price of 5,350 EUR is significantly lower than the reference price of 8,500 EUR, which is why the price score is low. The mileage is higher than the reference range of 80,000-120,000 km, so the mileage score is also low. The car falls within the target year range of 2011-2015, so it receives a high year score. The description mentions some scratches on the body, which lowers the condition score. The car is being sold by a private party, which is why the seller score is high. The car has several additional features, including navigation, air conditioning, cruise control, tire pressure sensor, USB/Bluetooth, electric mirrors, 16-inch wheels, fog lights, daytime running lights, a spare tire, a gear change indicator, and a trip computer, which is why the features score is high.",
    "reference_price": "8.500 euros",
    "reference_kilometers": "80.000 - 120.000 km",
    "reference_year_range": "2011-2015"
  },
  {
    "model": "Opel Corsa",
    "url": "https://es.wallapop.com/item/opel-corsa-2013-1009122510",
    "score": 72,
    "price_score": 75,
    "mileage_score": 60,
    "year_score": 85,
    "condition_score": 70,
    "seller_score": 70,
    "features_score": 70,
    "explanation": "The car received a price score of 75 because it is priced at 5900 euros, which is below the reference price of 8500 euros. However, this score is reduced by the higher mileage. The mileage score is 60 due to the car having 100000 km, which is towards the higher end of the reference range of 80000-120000 km. The year score is 85 as the car is from 2013, well within the target range of 2011-2015. The condition score is 70 based on the description provided, which does not indicate any major issues but also does not provide much detail. The seller score is 70 as it is a private seller, which can sometimes present additional risks compared to a dealer. The features score is 70 as the car has a few additional features such as GPS, Bluetooth, and a start-stop system.",
    "reference_price": "8.500 euros",
    "reference_kilometers": "80.000 - 120.000 km",
    "reference_year_range": "2011-2015"
  },
  {
    "model": "Seat León",
    "url": "https://es.wallapop.com/item/seat-leon-2-0-tdi-110kw-dsg-7-s-s-fr-go-xl-1070312572",
    "score": 72,
    "price_score": 70,
    "mileage_score": 50,
    "year_score": 80,
    "condition_score": 75,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car received a score of 72 out of 100. The price is acceptable at 18.990€, so it gets a score of 70 out of 100 for price. The mileage is a bit high at 46226 km, so it only gets a score of 50 out of 100 for mileage. The car is from 2021, which is good, so it gets a score of 80 out of 100 for year. The condition and maintenance are described as good, so it gets a score of 75 out of 100 for condition. The seller is a dealer, which is less favorable than a private seller, so it gets a score of 70 out of 100 for seller. The car has some additional features, so it gets a score of 80 out of 100 for features.",
    "reference_price": "18.500 - 20.500 euros",
    "reference_kilometers": "25.000 - 55.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Seat León",
    "url": "https://es.wallapop.com/item/seat-leon-st-2-0-tdi-sands-style-dsg-110-kw-150-cv-1069744304",
    "score": 72,
    "price_score": 60,
    "mileage_score": 50,
    "year_score": 100,
    "condition_score": 70,
    "seller_score": 80,
    "features_score": 85,
    "explanation": "The car received a score of 72 out of 100. The price score is 60, as the asking price of 19,445 EUR is slightly above the reference range. The mileage score is 50 because the car has 53,381 km, which is higher than the reference range. The year score is 100 because the car is from 2021, within the target range. The condition score is 70, based on the description mentioning a good maintenance history and a 1-year warranty. The seller score is 80, as it's a dealer (OCASIONPLUS L.) with multiple locations and positive seller indicators. The features score is 85, as the car has several desirable features like navigation, LED headlights, backup camera, Car Play, parking assistance, climate control, and Bluetooth.",
    "reference_price": "18.500 - 20.500 euros",
    "reference_kilometers": "25.000 - 55.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Seat León",
    "url": "https://es.wallapop.com/item/seat-leon-st-2-0-tdi-sands-style-dsg-110-kw-150-cv-1069419745",
    "score": 72,
    "price_score": 60,
    "mileage_score": 50,
    "year_score": 100,
    "condition_score": 70,
    "seller_score": 80,
    "features_score": 85,
    "explanation": "The car received a score of 72 out of 100. The price score is 60 because the offer price of 19,445 EUR is slightly above the reference range of 18,500 - 20,500 EUR. The mileage score is 50 because the car has 53,381 km, which is higher than the reference range of 25,000 - 55,000 km. The year score is 100 since the car is from 2021, within the target range of 2020-2022. The condition score is 70 based on the description mentioning a national car, a complete maintenance history, and a 1-year warranty with national coverage. The seller score is 80 because it is a dealer, which is more reliable than a private seller. The features score is 85 due to the presence of several additional features, such as a navigation system, LED headlights and taillights, a rearview camera, Car Play, parking assistance, a climate control system, and alloy wheels.",
    "reference_price": "18.500 - 20.500 euros",
    "reference_kilometers": "25.000 - 55.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Seat León",
    "url": "https://es.wallapop.com/item/seat-leon-st-1-5-tsi-sands-fr-go-l-110-kw-150-cv-1069419481",
    "score": 72,
    "price_score": 60,
    "mileage_score": 50,
    "year_score": 100,
    "condition_score": 80,
    "seller_score": 70,
    "features_score": 85,
    "explanation": "The car received a score of 100 for year because it is within the target range (2020-2022) and is a 2021 model. The price score is 60, as the offering price of 18,681 EUR is slightly above the reference range (18,500 - 20,500 EUR), but still within 5% of the range. The mileage score is 50 because the car has 54,636 km, which is higher than the reference range (25,000 - 55,000 km). The condition score is 80 based on the description, mentioning a 1-year total warranty, a covertura nacional, and a certificado de kilómetros y ausencia de golpes estructurales. The seller score is 70, as it is a dealer (OCASIONPLUS V.). The features score is 85, as the car has several desirable features such as a navegador, Car Play, tapicería cuero-tela, control de crucero adaptativo, asistente de mantenimiento de carril, asistente de aparcamiento, cámara de marcha atrás, faros delanteros led, faros traseros led, encendido automático de faros, sensor de lluvia, freno de estacionamiento eléctrico, control de velocidad, limitador de velocidad, volante multifunción, arranque por botón, aire acondicionado (climatizador), bluetooth, isofix, and llantas de aleación (17\").",
    "reference_price": "18.500 - 20.500 euros",
    "reference_kilometers": "25.000 - 55.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Seat León",
    "url": "https://es.wallapop.com/item/seat-leon-st-1-5-tsi-sands-fr-go-l-110-kw-150-cv-1069418649",
    "score": 72,
    "price_score": 60,
    "mileage_score": 50,
    "year_score": 100,
    "condition_score": 80,
    "seller_score": 70,
    "features_score": 85,
    "explanation": "The car received a score of 100 for year because it is within the target range (2020-2022) and is a 2021 model. The price score is 60, as the offering price of 18,681 EUR is slightly above the reference range (18,500 - 20,500 EUR), but still within 5% of the range. However, the list price of 20,550 EUR is above the reference range, which negatively impacts the price score. The mileage score is 50 because the car has 54,636 km, which is higher than the reference range (25,000 - 55,000 km). The condition score is 80 based on the description, which indicates that the car has a clean history, a full year warranty, and a certificate of mileage and absence of structural damage. The seller score is 70, as the seller is a dealer (OCASIONPLUS M.), which is slightly less favorable than a private seller. The features score is 85, as the car has several desirable features, such as a navigation system, Car Play, adaptive cruise control, lane assist, parking assist, a rearview camera, LED headlights and taillights, automatic headlights, rain sensor, electric parking brake, speed control, speed limiter, multifunction steering wheel, push-button start, air conditioning (climate control), Bluetooth, Isofix, and 17-inch alloy wheels.",
    "reference_price": "18.500 - 20.500 euros",
    "reference_kilometers": "25.000 - 55.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Seat León",
    "url": "https://es.wallapop.com/item/seat-leon-sp-1-4-e-hybrid-dsg-s-s-fr-go-xl-1064567550",
    "score": 72,
    "price_score": 60,
    "mileage_score": 50,
    "year_score": 100,
    "condition_score": 70,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car is being offered at a price of 19,490 EUR, which is slightly below the reference range of 18,500 - 20,500 EUR. However, it's important to note that this price is only available with 100% financing, and the actual cash price is 23,890 EUR. The mileage of the car is 48,205 km, which is higher than the reference range of 25,000 - 55,000 km. The car is from the year 2020, which is within the target range of 2020-2022. The overall condition and maintenance of the car is described as good, but there are no specific details provided. The car is being sold by a dealer, which can be both positive and negative depending on the buyer's preference. The car has several additional features and equipment, such as a hybrid engine, automatic transmission, and 5 doors, which adds to its value.",
    "reference_price": "18.500 - 20.500 euros",
    "reference_kilometers": "25.000 - 55.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Seat León",
    "url": "https://es.wallapop.com/item/seat-leon-st-1-5-ecotsi-sands-fr-fast-edition-plus-dsg-110-kw-150-cv-1060013219",
    "score": 72,
    "price_score": 60,
    "mileage_score": 50,
    "year_score": 100,
    "condition_score": 70,
    "seller_score": 80,
    "features_score": 85,
    "explanation": "The car received a score of 72 out of 100. The price score is 60, as the offering price of 18,636 EUR is slightly above the reference range. The mileage score is 50 because the car has 45,474 km, which is towards the higher end of the reference range. The year score is 100, as the car is from 2020, well within the target range. The condition score is 70, based on the description mentioning a guaranteed 1-year warranty, a certificate of kilometers, and no structural damage. The seller score is 80, as the seller is a dealer, providing some assurance. The features score is 85, as the car has several desirable features such as navigation, Car Play, backup camera, LED headlights and taillights, rain sensor, adaptive cruise control, and more.",
    "reference_price": "18.500 - 20.500 euros",
    "reference_kilometers": "25.000 - 55.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Seat León",
    "url": "https://es.wallapop.com/item/seat-leon-1-0-tsi-sands-reference-go-66-kw-90-cv-1041530851",
    "score": 72,
    "price_score": 60,
    "mileage_score": 50,
    "year_score": 80,
    "condition_score": 75,
    "seller_score": 80,
    "features_score": 85,
    "explanation": "The car being appraised is a 2021 SEAT León with 32,086 km. The price of 17,264 EUR is subject to financing and the cash price is 18,990 EUR. This is slightly below the reference price range of 18,500 - 20,500 EUR, hence the price score is 60. The mileage is higher than the reference range of 25,000 - 55,000 km, so the mileage score is 50. The car is within the target year range, so the year score is 80. Based on the description, the overall condition and maintenance of the car seems good, so the condition score is 75. The car is being sold by a dealer, which is a positive factor, so the seller score is 80. The car has several additional features such as Car Play, lane maintenance assistance, LED headlights and taillights, automatic headlights, electric parking brake, speed control, Bluetooth, Isofix, and alloy wheels, so the features score is 85. The final score is the average of all the individual scores, which is 72.",
    "reference_price": "18.500 - 20.500 euros",
    "reference_kilometers": "25.000 - 55.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Seat León",
    "url": "https://es.wallapop.com/item/seat-leon-1-5-tgi-gnc-sands-fr-fast-edition-dsg-96-kw-130-cv-1036700478",
    "score": 72,
    "price_score": 60,
    "mileage_score": 50,
    "year_score": 100,
    "condition_score": 70,
    "seller_score": 80,
    "features_score": 85,
    "explanation": "The car received a score of 72 out of 100. The price is slightly above the reference range, hence the price score is 60. The mileage is higher than the reference range, which results in a mileage score of 50. The car is within the target year range, so the year score is 100. The overall condition and maintenance seem good based on the description, so the condition score is 70. The seller is a dealer, which is better than a private seller, so the seller score is 80. The car has several additional features and equipment, which results in a high features score of 85.",
    "reference_price": "18.500 - 20.500 euros",
    "reference_kilometers": "25.000 - 55.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Peugeot 308",
    "url": "https://es.wallapop.com/item/peugeot-308-5p-allure-1-2-puretech-81kw-110cv-1070293938",
    "score": 72,
    "price_score": 60,
    "mileage_score": 70,
    "year_score": 100,
    "condition_score": 65,
    "seller_score": 70,
    "features_score": 75,
    "explanation": "The car is being sold for 11.490€ with a financing option, which is lower than the reference price range. However, the regular price is 13.490€ which is higher than the reference range. The mileage is 53350 km which is within the reference range but closer to the higher end. The car is from the year 2019 which is within the target range. The description does not provide much information about the condition of the car, so it's difficult to give a high score. The car is being sold by a dealer, which is a neutral factor. The car has additional features such as financing options and a premium guarantee, which adds value to the car.",
    "reference_price": "18.000 - 20.000 euros",
    "reference_kilometers": "35.000 - 65.000 km",
    "reference_year_range": "2019-2021"
  },
  {
    "model": "Peugeot 308",
    "url": "https://es.wallapop.com/item/peugeot-308-sw-allure-pack-1068865613",
    "score": 72,
    "price_score": 60,
    "mileage_score": 70,
    "year_score": 100,
    "condition_score": 75,
    "seller_score": 80,
    "features_score": 70,
    "explanation": "The car is a 2021 model, which is within the target range and gets a perfect score for year. The mileage is 50695 km, slightly above the reference range of 35.000 - 65.000 km, hence the score of 70. The price is 15.750€, which is below the reference range of 18.000 - 20.000 euros, so it gets a score of 60. The car's overall condition and maintenance based on the description seems good, with features like maintenance of the model (2), paquete confort, paquete Safety plus, and warranty of up to 4 years, hence the score of 75. The seller is a dealer, which is more reliable than a private seller, so it gets a score of 80. The car has some additional features and equipment like automatic headlights, rain sensor, LED daytime running lights, heated rear window, etc., hence the score of 70.",
    "reference_price": "18.000 - 20.000 euros",
    "reference_kilometers": "35.000 - 65.000 km",
    "reference_year_range": "2019-2021"
  },
  {
    "model": "Renault Clio E-Tech Híbrido",
    "url": "https://es.wallapop.com/item/renault-clio-2021-1067983952",
    "score": 72,
    "price_score": 60,
    "mileage_score": 80,
    "year_score": 100,
    "condition_score": 85,
    "seller_score": 70,
    "features_score": 75,
    "explanation": "The car received a score of 72 out of 100. The price score is 60 because the asking price of 15,500 euros is slightly above the reference range of 19,500-21,500 euros. The mileage score is 80 since the car has 43,000 km, which is within the reference range of 15,000-45,000 km. The year score is 100 because the car is from 2021, which is within the target range of 2020-2022. The condition score is 85 as the car has been well-maintained, stored in a private garage, and had all its revisions done in an official Renault dealership. The seller score is 70 because it is a private seller, which may require more caution compared to a dealership. The features score is 75 because the car has several desirable features, such as Start&Stop, automatic transmission, and various safety features.",
    "reference_price": "19.500 - 21.500 euros",
    "reference_kilometers": "15.000 - 45.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Renault Clio E-Tech Híbrido",
    "url": "https://es.wallapop.com/item/renault-clio-clio-e-tech-hibrido-zen-103kw-zen-1059063321",
    "score": 72,
    "price_score": 60,
    "mileage_score": 50,
    "year_score": 100,
    "condition_score": 70,
    "seller_score": 80,
    "features_score": 85,
    "explanation": "The car received a good score for the year (2021) being within the target range. The price is slightly below the reference range, but not significantly, hence the price score is 60. The mileage is higher than the reference range, which lowered the score to 50. The overall condition and maintenance are good based on the description, earning a score of 70. The seller is a dealer, which is better than a private seller, so the seller score is 80. The car has several additional features and equipment, which contributed to a high features score of 85. However, the high mileage and average price lowered the total score to 72.",
    "reference_price": "19.500 - 21.500 euros",
    "reference_kilometers": "15.000 - 45.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Seat Ibiza",
    "url": "https://es.wallapop.com/item/seat-ibiza-2016-1060592334",
    "score": 65,
    "price_score": 60,
    "mileage_score": 50,
    "year_score": 80,
    "condition_score": 70,
    "seller_score": 70,
    "features_score": 70,
    "explanation": "The car is a 2016 SEAT Ibiza, which is within the target year range, so it gets a high year score. However, the mileage is slightly higher than the reference range, so it gets a lower mileage score. The price is significantly lower than the reference price, but it's a private sale and the car has higher mileage, so the price score is moderate. The condition of the car seems good based on the description, but there are no details about maintenance, so the condition score is moderate. The seller is a private party, which is neutral in terms of score. The car has basic features, so the features score is moderate. Overall, the car is a decent value for the price, but the mileage is a bit high.",
    "reference_price": "8.700 euros",
    "reference_kilometers": "80.000 - 120.000 km",
    "reference_year_range": "2012-2016"
  },
  {
    "model": "Ford Focus",
    "url": "https://es.wallapop.com/item/ford-focus-ecoboost-2011-1055412602",
    "score": 65,
    "price_score": 40,
    "mileage_score": 60,
    "year_score": 70,
    "condition_score": 50,
    "seller_score": 60,
    "features_score": 70,
    "explanation": "The car is a 2011 Ford Focus Ecoboost with 127,000 km, which is within the target year range (2011-2015) but has higher mileage compared to the reference (90,000 - 140,000 km). The price of 7,000 euros is significantly lower than the reference (9,200 euros), but this is offset by the higher mileage and the fact that the car has had a rebuilt engine and has some damage to the body. The car is being sold by a private party, which is a neutral factor in the rating. The car has several additional features and equipment, which slightly increases the score.",
    "reference_price": "9.200 euros",
    "reference_kilometers": "90.000 - 140.000 km",
    "reference_year_range": "2011-2015"
  },
  {
    "model": "Peugeot 208",
    "url": "https://es.wallapop.com/item/peugeot-208-2013-1071223659",
    "score": 65,
    "price_score": 40,
    "mileage_score": 60,
    "year_score": 70,
    "condition_score": 70,
    "seller_score": 60,
    "features_score": 60,
    "explanation": "The car received a score of 65. The price score is 40, which is low because the asking price of 5500 euros is significantly below the reference price of 8800 euros. The mileage score is 60, which is in the middle range, as the car has 106,000 km, which is higher than the reference range of 75,000-115,000 km. The year score is 70, as the car is from 2013, which is within the target range of 2012-2016. The condition score is 70, as the car is described as 'bien conservado' (well-preserved) and has a valid ITV (technical inspection of vehicles) until February. The seller score is 60, as the seller is a private party, which may present some risk compared to a dealer. The features score is 60, as the car has manual transmission and is a non-smoking vehicle, but no other notable features are mentioned.",
    "reference_price": "8.800 euros",
    "reference_kilometers": "75.000 - 115.000 km",
    "reference_year_range": "2012-2016"
  },
  {
    "model": "Peugeot 308",
    "url": "https://es.wallapop.com/item/peugeot-308-5p-allure-1-2-puretech-81kw-110cv-1070312812",
    "score": 65,
    "price_score": 60,
    "mileage_score": 50,
    "year_score": 80,
    "condition_score": 70,
    "seller_score": 70,
    "features_score": 70,
    "explanation": "The car received a score of 65 out of 100. The price score is 60, which is below average for the reference price range. The mileage score is 50, which is lower than the reference range. The car's year is within the target range, so it received a score of 80. The condition score is 70, based on the description provided. The seller score is 70, as it is a dealer. The features score is 70, as there is no information about additional features or equipment.",
    "reference_price": "18.000 - 20.000 euros",
    "reference_kilometers": "35.000 - 65.000 km",
    "reference_year_range": "2019-2021"
  },
  {
    "model": "Peugeot 308",
    "url": "https://es.wallapop.com/item/peugeot-308-active-1068865265",
    "score": 65,
    "price_score": 60,
    "mileage_score": 50,
    "year_score": 80,
    "condition_score": 70,
    "seller_score": 80,
    "features_score": 70,
    "explanation": "The car received a score of 65 out of 100. The price score is 60, as the asking price of 10,940 EUR is slightly above the reference range. The mileage score is 50 because the car has 57,366 km, which is higher than the reference range. The year score is 80, as the car is from 2019, within the target range. The condition score is 70, based on the description indicating that it's in good condition with up to 4 years of warranty. The seller score is 80, as it's a dealer, which is more reliable than a private seller. The features score is 70, as the car has some additional features like Bluetooth and automatic lights.",
    "reference_price": "18.000 - 20.000 euros",
    "reference_kilometers": "35.000 - 65.000 km",
    "reference_year_range": "2019-2021"
  },
  {
    "model": "Peugeot 308",
    "url": "https://es.wallapop.com/item/peugeot-308-5p-allure-pack-bluehdi-130-s-s-eat8-1064562020",
    "score": 65,
    "price_score": 60,
    "mileage_score": 40,
    "year_score": 100,
    "condition_score": 70,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car is a 2021 model, which is great (100 points for year). However, the price is 5410 euros above the reference range (6.990 euros above the lower limit), which is why it only gets 60 points for price. The mileage is 10.590 km above the upper limit of the reference range, hence the score of 40 for mileage. The description suggests that the car is in good condition and has been well-maintained, so it gets 70 points for condition. As a dealer, the seller gets 70 points for seller type. The car has some additional features (BlueHDI 130 S&S EAT8), which is why it gets 80 points for features.",
    "reference_price": "18.000 - 20.000 euros",
    "reference_kilometers": "35.000 - 65.000 km",
    "reference_year_range": "2019-2021"
  },
  {
    "model": "Peugeot 308",
    "url": "https://es.wallapop.com/item/peugeot-308-2019-1062516719",
    "score": 65,
    "price_score": 30,
    "mileage_score": 40,
    "year_score": 100,
    "condition_score": 80,
    "seller_score": 70,
    "features_score": 60,
    "explanation": "The car received a high year score (100) as it is within the target range (2019). The price score (30) is low because the asking price of 14,500 euros is below the reference range (18,000 - 20,000 euros). The mileage score (40) is lower than the reference range (35,000 - 65,000 km) as the car has 56,640 km. The condition score (80) is high based on the description of regular maintenance and no accidents. The seller score (70) is moderate because it is a private seller, which may require more effort from the buyer. The features score (60) is moderate, as there are no notable additional features mentioned.",
    "reference_price": "18.000 - 20.000 euros",
    "reference_kilometers": "35.000 - 65.000 km",
    "reference_year_range": "2019-2021"
  },
  {
    "model": "Volkswagen Golf",
    "url": "https://es.wallapop.com/item/volkswagen-golf-sport-1-6-tdi-77-kw-105-cv-1070353735",
    "score": 55,
    "price_score": 30,
    "mileage_score": 30,
    "year_score": 60,
    "condition_score": 60,
    "seller_score": 70,
    "features_score": 70,
    "explanation": "The car is a 2010 Volkswagen Golf with 148193 km, priced at 9500 EUR. This is significantly lower than the reference price range of 19000-21000 EUR, hence the low price score. The mileage is also higher than the reference range of 30000-60000 km, contributing to a low mileage score. However, the car is within the target year range of 2020-2022, earning a high year score. The condition of the car seems decent based on the description, earning a moderate condition score. The seller is a dealer, which is a positive factor, earning a high seller score. The car also has several additional features, earning a high features score.",
    "reference_price": "19.000 - 21.000 euros",
    "reference_kilometers": "30.000 - 60.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Volkswagen Golf",
    "url": "https://es.wallapop.com/item/volkswagen-golf-sport-1-6-tdi-77-kw-105-cv-1070055771",
    "score": 55,
    "price_score": 30,
    "mileage_score": 30,
    "year_score": 70,
    "condition_score": 60,
    "seller_score": 70,
    "features_score": 80,
    "explanation": "The car is a 2010 Volkswagen Golf with 148193 km, priced at 9500 EUR. This is below the reference price range of 19000-21000 EUR, hence the low price score. The mileage is also above the reference range of 30000-60000 km, contributing to a low mileage score. The car is within the target year range (2010 is within 2020-2022), earning a high year score. The description suggests that the car is in good condition and has been maintained well, but without photos or a more detailed description, it's difficult to give a high condition score. The car is being sold by a dealer, which is a positive factor, earning a high seller score. The car has several additional features and equipment, earning a high features score.",
    "reference_price": "19.000 - 21.000 euros",
    "reference_kilometers": "30.000 - 60.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Volkswagen Golf",
    "url": "https://es.wallapop.com/item/opel-astra-2012-927268408",
    "score": 55,
    "price_score": 20,
    "mileage_score": 40,
    "year_score": 0,
    "condition_score": 60,
    "seller_score": 60,
    "features_score": 70,
    "explanation": "The car received a low price score (20/100) because the asking price of 8500 euros is far below the reference range of 19000-21000 euros. The mileage score is 40/100, as 130000 km is higher than the preferred range of 30000-60000 km. The car's year (2012) is not within the target range of 2020-2022, so it received a year score of 0/100. The condition score is 60/100, based on the description of regular maintenance but an older car. The seller score is 60/100, as it is a private sale. The car has many additional features, earning it a features score of 70/100.",
    "reference_price": "19.000 - 21.000 euros",
    "reference_kilometers": "30.000 - 60.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Volkswagen Golf",
    "url": "https://es.wallapop.com/item/volkswagen-golf-rabbit-2-5-170cv-auto-678812651",
    "score": 55,
    "price_score": 30,
    "mileage_score": 20,
    "year_score": 20,
    "condition_score": 60,
    "seller_score": 60,
    "features_score": 30,
    "explanation": "The car received a low price score (30/100) because the asking price of 17,500 euros is above the reference range of 19,000-21,000 euros. The mileage score is 20/100, as the car has 116,371 km, which is higher than the reference range of 30,000-60,000 km. The year score is 20/100 because the car is a 2011 model, which is outside the target range of 2020-2022. The condition score is 60/100; the car has been well-maintained, stored in a garage, and has a valid inspection. However, it has higher mileage and is older than the reference. The seller score is 60/100, as it is a private sale. Private sales can sometimes have more risks than dealer sales. The features score is 30/100, as the car has a few desirable features, such as automatic transmission and good overall condition, but it has higher mileage, an older model year, and a higher asking price.",
    "reference_price": "19.000 - 21.000 euros",
    "reference_kilometers": "30.000 - 60.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Volkswagen Golf",
    "url": "https://es.wallapop.com/item/seat-ibiza-2015-668902826",
    "score": 55,
    "price_score": 30,
    "mileage_score": 40,
    "year_score": 0,
    "condition_score": 70,
    "seller_score": 60,
    "features_score": 60,
    "explanation": "The car received a score of 55 out of 100. The price score is 30, as the car is significantly cheaper than the reference price range. However, this lower price might be due to its age and high mileage. The mileage score is 40, the car has more kilometers than the reference range. The year score is 0 because the car is from 2015, outside of the target range. The condition score is 70, the car seems to be in good condition and well maintained based on the description, with new tires and brakes, and a valid ITV until 2023. The seller score is 60, a private seller, which can be a good or bad thing depending on the buyer's preference. The features score is 60, the car has some additional features like a sound system, navigation screen, and central locking, but it's not particularly well-equipped.",
    "reference_price": "19.000 - 21.000 euros",
    "reference_kilometers": "30.000 - 60.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Volkswagen Golf",
    "url": "https://es.wallapop.com/item/citroen-c3-2010-1062510423",
    "score": 52,
    "price_score": 20,
    "mileage_score": 40,
    "year_score": 0,
    "condition_score": 70,
    "seller_score": 60,
    "features_score": 80,
    "explanation": "The car is a 2010 Citroen C3 with 119,000 km, which is more expensive than the reference price range of 19,000 - 21,000 euros, resulting in a low price score. The mileage is higher than the reference range of 30,000 - 60,000 km, so the mileage score is also lower. The car is older than the target range of 2020-2022, so it receives a zero for the year score. The overall condition and maintenance of the car seem good based on the description, earning a high condition score. The car is being sold by a private party, which is a neutral factor, so it gets a middle-of-the-road score for seller type. The car has several additional features and equipment, which boosts its score in this category. The final score is an average of the individual scores, reflecting the car's higher price and mileage, but good condition and features.",
    "reference_price": "19.000 - 21.000 euros",
    "reference_kilometers": "30.000 - 60.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Volkswagen Golf",
    "url": "https://es.wallapop.com/item/volkswagen-golf-edition-1-4-59-kw-80-cv-1057750436",
    "score": 50,
    "price_score": 25,
    "mileage_score": 30,
    "year_score": 60,
    "condition_score": 60,
    "seller_score": 70,
    "features_score": 70,
    "explanation": "The car is a 2011 Volkswagen Golf with 101462 km. The price of 9200 EUR is below the reference range, which negatively impacts the score. The mileage is higher than the reference range, but not significantly, so it has a moderate impact on the score. The car is older than the target range, but not by much, so it still gets a decent score. The condition and maintenance seem good based on the description, earning a high score. The seller is a dealer, which is positive. The car has several additional features, also positively impacting the score.",
    "reference_price": "19.000 - 21.000 euros",
    "reference_kilometers": "30.000 - 60.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Volkswagen Golf",
    "url": "https://es.wallapop.com/item/volkswagen-golf-edition-1-4-59-kw-80-cv-1057457022",
    "score": 50,
    "price_score": 25,
    "mileage_score": 30,
    "year_score": 50,
    "condition_score": 60,
    "seller_score": 70,
    "features_score": 60,
    "explanation": "The car is a 2011 Volkswagen Golf with 101462 km, priced at 9,200 EUR. The price is significantly lower than the reference range of 19,000 - 21,000 EUR, which negatively impacts the score. The mileage is slightly higher than the reference range of 30,000 - 60,000 km, but not significantly, so it has a moderate impact on the score. The car is older than the target range of 2020-2022, which reduces the score. The condition and maintenance seem to be good based on the description, with features like air conditioning, servodirection, and ISOFIX. The seller is a dealer, which is positive, and there are some additional features, but not many, so it has a moderate impact on the score. Overall, the car is priced low, but it is older and has higher mileage than the reference, with average condition and features.",
    "reference_price": "19.000 - 21.000 euros",
    "reference_kilometers": "30.000 - 60.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Volkswagen Golf",
    "url": "https://es.wallapop.com/item/audi-a1-2011-993072624",
    "score": 50,
    "price_score": 25,
    "mileage_score": 40,
    "year_score": 0,
    "condition_score": 70,
    "seller_score": 60,
    "features_score": 60,
    "explanation": "The car received a score of 50 out of 100. The price score is 25, as the car is significantly cheaper than the reference price range. However, this lower price might be due to its age, which is beyond the target range. The mileage score is 40, as it is higher than the reference range but still acceptable considering the car's age. The year score is 0, as the car is from 2011, which is outside the target range of 2020-2022. The condition score is 70, as the car seems to be well-maintained and serviced regularly. The seller score is 60, as it is a private seller, which might require more caution during the buying process. The features score is 60, as the car has some desirable features like original wheels, new front tires, and a valid ITV (inspection).",
    "reference_price": "19.000 - 21.000 euros",
    "reference_kilometers": "30.000 - 60.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Volkswagen Golf",
    "url": "https://es.wallapop.com/item/volkswagen-golf-2010-1065087192",
    "score": 45,
    "price_score": 20,
    "mileage_score": 30,
    "year_score": 0,
    "condition_score": 60,
    "seller_score": 50,
    "features_score": 40,
    "explanation": "The car is listed at 9500€, which is quite a bit lower than the reference price range of 19.000 - 21.000 euros, hence the price score is 20. The mileage of 135000 km is a bit higher than the reference range of 30.000 - 60.000 km, so the mileage score is 30. The car is from 2010, which is outside of the target range of 2020-2022, so the year score is 0. The description suggests that the car is in good condition and recently passed ITV, but it does not provide much detail, so the condition score is 60. The car is being sold by a private party, which is neutral, so the seller score is 50. The car has automatic transmission, which is a positive feature, but no other notable features are mentioned, so the features score is 40. The final score is the average of these individual scores, which is 45.",
    "reference_price": "19.000 - 21.000 euros",
    "reference_kilometers": "30.000 - 60.000 km",
    "reference_year_range": "2020-2022"
  },
  {
    "model": "Volkswagen Golf",
    "url": "https://es.wallapop.com/item/volkswagen-golf-2010-1053493934",
    "score": 45,
    "price_score": 20,
    "mileage_score": 30,
    "year_score": 0,
    "condition_score": 70,
    "seller_score": 60,
    "features_score": 10,
    "explanation": "The car received a low price score of 20 because its price is significantly lower than the reference range (19.000 - 21.000 euros). The mileage score is 30, which is below the reference range of 30.000 - 60.000 km. The year score is 0 because the car is from 2010, which is outside the target range of 2020-2022. The condition score is 70, which is relatively high, based on the description of the car being in perfect condition and having new tires, battery, and a recent ITV. The seller score is 60, as it is a private sale, which can come with some risks. The features score is 10, as the car does not seem to have any additional features or equipment beyond what is expected for a standard Golf model.",
    "reference_price": "19.000 - 21.000 euros",
    "reference_kilometers": "30.000 - 60.000 km",
    "reference_year_range": "2020-2022"
  }
]